title: Quasar RAT TTPs - Process Execution
id: 496218e6-882b-4979-9dba-90a096a3dde8-process
status: experimental
description: Detects scheduled task creation with highest privileges and rapid shutdown commands associated with Quasar RAT.
author: RW
logsource:
  category: process_creation
  product: windows
detection:
  selection_schtasks:
    Image|endswith: '\schtasks.exe'
    CommandLine|contains|all:
      - '/create'
      - '/rl'
      - 'HIGHEST'
  selection_shutdown:
    Image|endswith: '\shutdown.exe'
    CommandLine|contains:
      - ' /s /t 0'
      - ' /r /t 0'
  condition: 1 of selection_*
level: high