title: Salt Typhoon APT - Windows Process Behaviors
id: 3ff3598b-52ae-4898-b707-24ee930eee4d-process
status: experimental
description: Detects Windows process execution TTPs associated with Salt Typhoon, including PowerShell downgrades, AMSI bypasses, LSASS dumping, and webshell execution.
author: RW
date: 2025-09-27
tags:
  - attack.defense_evasion
  - attack.credential_access
  - attack.execution
  - apt.salt_typhoon
logsource:
  category: process_creation
  product: windows
detection:
  selection_ttp_ps_downgrade:
    Image|endswith: '\powershell.exe'
    CommandLine|contains|all:
      - '-Version'
      - '2'
    CommandLine|contains:
      - '-enc'
      - '-command'
  selection_ttp_amsi_bypass:
    CommandLine|contains:
      - '[System.Management.Automation.AMSIUtils]'
      - 'Set-MpPreference -DisableRealtimeMonitoring'
  selection_ttp_cred_dump:
    Image|endswith: '\rundll32.exe'
    CommandLine|contains|all:
      - 'comsvcs.dll'
      - 'MiniDump'
  selection_ttp_webshell:
    ParentImage|endswith:
      - '\w3wp.exe'
      - '\httpd.exe'
      - '\nginx.exe'
      - '\tomcat.exe'
    Image|endswith:
      - '\cmd.exe'
      - '\powershell.exe'
  condition: 1 of selection_*
level: high