title: Domain Admin Group Reconnaissance
id: b452e109-4c02-4c53-b5ff-533d567d07aa
status: experimental
description: Detects reconnaissance of the 'Domain Admins' group using common command-line tools. This is a known TTP of the threat actor Salt Typhoon to identify privileged accounts.
references:
author: RW
date: 2025-07-31
tags:
  - attack.discovery
  - attack.t1069.002
  - threat_group.salt_typhoon
logsource:
  category: process_creation
  product: windows
detection:
  selection_net:
        # Detects 'net.exe' used to query the Domain Admins group
    Image|endswith:
      - '\net.exe'
      - '\net1.exe'
    CommandLine|contains|all:
      - 'group'
      - 'Domain Admins'
  selection_pwsh:
        # Detects PowerShell used to query the Domain Admins group
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains|all:
      - 'Get-ADGroup'       # Catches Get-ADGroup and Get-ADGroupMember
      - 'Domain Admins'
  condition: 1 of them
falsepositives:
  - Legitimate administrative activity by system administrators, help desk staff, or security auditors.
  - Automated scripts for identity and access management or auditing may also trigger this rule.
  - Consider filtering based on known administrative accounts or specific parent processes if this is common in your environment.
level: medium
