title: MuddyWater ChainShell - Process & Persistence Artifacts
id: 6dd368d0-b195-4592-9795-abfa1ba5c758-1
status: experimental
description: Detects scheduled task creation for CastleRAT persistence and ChainShell portable Node.js execution.
author: RW
date: 2026-04-13
logsource:
  category: process_creation
  product: windows
detection:
  selection_schtasks:
    CommandLine|contains|all:
      - 'schtasks'
      - '/create'
      - 'Virtual'
      - 'Guy'
  selection_node:
    Image|contains: '\AppData\Local\Nodejs\node-v18.17.0-win-x64\'
  condition: 1 of selection_*
level: critical