<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions" >

	<displayName >Enter Display Name here</displayName>
	<description >Enter Description of ADMX File</description>
	<resources >
		<stringTable ><!--Storage for String Definitions-->

			<string id="String_SupportedOn_Undefined_2" >Undefined</string>
			<string id="String_SupportedOn_Undefined_4" >Undefined</string>
			<string id="String_SupportedOn_Undefined_6" >Undefined</string>
			<string id="String_SupportedOn_Undefined_8" >Undefined</string>
			<string id="String_SupportedOn_Undefined_10" >Undefined</string>
			<string id="String_SupportedOn_Undefined_12" >Undefined</string>
			<string id="String_SupportedOn_Undefined_14" >Undefined</string>
			<string id="String_SupportedOn_Undefined_16" >Undefined</string>
			<string id="String_SupportedOn_Undefined_18" >Undefined</string>
			<string id="String_SupportedOn_Undefined_20" >Undefined</string>
			<string id="String_SupportedOn_Undefined_21" >Undefined</string>
			<string id="String_SupportedOn_Undefined_22" >Undefined</string>
			<string id="String_SupportedOn_Undefined_24" >Undefined</string>
			<string id="String_SupportedOn_Undefined_26" >Undefined</string>
			<string id="String_SupportedOn_Undefined_28" >Undefined</string>
			<string id="String_SupportedOn_Undefined_30" >Undefined</string>
			<string id="String_SupportedOn_Undefined_32" >Undefined</string>
			<string id="String_SupportedOn_Undefined_34" >Undefined</string>
			<string id="String_SupportedOn_Undefined_36" >Undefined</string>
			<string id="String_SupportedOn_Undefined_38" >Undefined</string>
			<string id="String_SupportedOn_Undefined_40" >Undefined</string>
			<string id="String_SupportedOn_Undefined_42" >Undefined</string>
			<string id="String_SupportedOn_Undefined_44" >Undefined</string>
			<string id="String_SupportedOn_Undefined_46" >Undefined</string>
			<string id="String_SupportedOn_Undefined_48" >Undefined</string>
			<string id="String_SupportedOn_Undefined_50" >Undefined</string>
			<string id="String_SupportedOn_Undefined_52" >Undefined</string>
			<string id="String_SupportedOn_Undefined_54" >Undefined</string>
			<string id="String_SupportedOn_Undefined_56" >Undefined</string>
			<string id="String_SupportedOn_Undefined_58" >Undefined</string>
			<string id="String_SupportedOn_Undefined_60" >Undefined</string>
			<string id="String_SupportedOn_Undefined_62" >Undefined</string>
			<string id="String_SupportedOn_Undefined_64" >Undefined</string>
			<string id="String_SupportedOn_Undefined_66" >Undefined</string>
			<string id="String_SupportedOn_Undefined_68" >Undefined</string>
			<string id="String_SupportedOn_Undefined_70" >Undefined</string>
			<string id="String_SupportedOn_Undefined_72" >Undefined</string>
			<string id="String_SupportedOn_Undefined_74" >Undefined</string>
			<string id="String_SupportedOn_Undefined_76" >Undefined</string>
			<string id="String_SupportedOn_Undefined_78" >Undefined</string>
			<string id="String_SupportedOn_Undefined_80" >Undefined</string>
			<string id="String_SupportedOn_Undefined_82" >Undefined</string>
			<string id="String_SupportedOn_Undefined_84" >Undefined</string>
			<string id="String_SupportedOn_Undefined_86" >Undefined</string>
			<string id="String_SupportedOn_Undefined_88" >Undefined</string>
			<string id="String_SupportedOn_Undefined_90" >Undefined</string>
			<string id="String_SupportedOn_Undefined_92" >Undefined</string>
			<string id="String_SupportedOn_Undefined_94" >Undefined</string>
			<string id="String_SupportedOn_Undefined_96" >Undefined</string>
			<string id="String_SupportedOn_Undefined_97" >Undefined</string>
			<string id="String_SupportedOn_Undefined_98" >Undefined</string>
			<string id="String_SupportedOn_Undefined_100" >Undefined</string>
			<string id="String_SupportedOn_Undefined_102" >Undefined</string>
			<string id="String_SupportedOn_Undefined_104" >Undefined</string>
			<string id="String_SupportedOn_Undefined_106" >Undefined</string>
			<string id="String_SupportedOn_Undefined_108" >Undefined</string>
			<string id="String_SupportedOn_Undefined_110" >Undefined</string>
			<string id="String_SupportedOn_Undefined_112" >Undefined</string>
			<string id="String_SupportedOn_Undefined_114" >Undefined</string>
			<string id="String_SupportedOn_Undefined_116" >Undefined</string>
			<string id="String_SupportedOn_Undefined_118" >Undefined</string>
			<string id="String_SupportedOn_Undefined_120" >Undefined</string>
			<string id="String_SupportedOn_Undefined_122" >Undefined</string>
			<string id="String_SupportedOn_Undefined_124" >Undefined</string>
			<string id="String_SupportedOn_Undefined_126" >Undefined</string>
			<string id="String_SupportedOn_Undefined_128" >Undefined</string>
			<string id="String_SupportedOn_Undefined_130" >Undefined</string>
			<string id="String_SupportedOn_Undefined_132" >Undefined</string>
			<string id="String_SupportedOn_Undefined_134" >Undefined</string>
			<string id="String_SupportedOn_Undefined_136" >Undefined</string>
			<string id="String_SupportedOn_Undefined_138" >Undefined</string>
			<string id="String_SupportedOn_Undefined_140" >Undefined</string>
			<string id="String_SupportedOn_Undefined_142" >Undefined</string>
			<string id="String_SupportedOn_Undefined_144" >Undefined</string>
			<string id="String_SupportedOn_Undefined_146" >Undefined</string>
			<string id="String_SupportedOn_Undefined_148" >Undefined</string>
			<string id="String_SupportedOn_Undefined_150" >Undefined</string>
			<string id="String_SupportedOn_Undefined_152" >Undefined</string>
			<string id="String_Cat_PCoIP_Session_Variables_154" >PCoIP Session Variables</string>
			<string id="String_Cat_Not_Overridable_156" >Not Overridable Administrator Settings</string>
			<string id="String_Cat_Overridable_Administrator_158" >Overridable Administrator Defaults</string>
			<string id="String_Policy_Turn_off_Build_to_Lossles_160" >Turn off Build-to-Lossless feature</string>
			<string id="String_Explain_Specifies_whether_161" >Specifies whether to turn the build-to-lossless feature of the PCoIP protocol off or on; this feature is turned off by default.

If this setting is Enabled or Not Configured then the build-to-lossless feature is turned off and images and other desktop content may never build to a lossless state. In network environments with constrained bandwidth, turning off the build-to-lossless feature can provide bandwidth savings. If this setting is Disabled then the build-to-lossless feature is turned on; this is recommended for environments that require images and desktop content to be built to a lossless state.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Configure_the_maximum_163" >Configure the maximum PCoIP session bandwidth</string>
			<string id="String_Explain_Specifies_the_maximum_164" >Specifies the maximum bandwidth, in kilobits per second, in a PCoIP session. The bandwidth includes all imaging, audio, virtual channel, USB, and control PCoIP traffic.

Set this value based on the overall capacity of the link to which your endpoint is connected, taking into consideration the number of expected concurrent PCoIP sessions. For example, with a single user VDI configuration (e.g. a single PCoIP session) that connects through a 4Mbit/s Internet connection, set this value to 4Mbit (or 10% less than this value to leave some allowance for other network traffic). When you expect multiple concurrent PCoIP sessions to share a link (e.g. multiple VDI users or a RDSH configuration), you may want to adjust the setting accordingly, however this will restrict the maximum bandwidth for each active session.

Setting this value prevents the agent from attempting to transmit at a higher rate than the link capacity, which would cause excessive packet loss and a poorer user experience. This value is symmetric. It forces the client and agent to use the lower of the two values that are set on the client and agent side. For example, setting a 4Mbit/s maximum bandwidth forces the agent to transmit at a lower rate, even though the setting is configured on the client.

When this setting is disabled or not configured on an endpoint, the endpoint imposes no bandwidth constraints. When this setting is configured, the setting is used as the endpoint's maximum bandwidth constraint in kilobits per second.

The default value when this setting is not configured is 900000 kilobits per second.

This setting applies to the agent and client. If the two endpoints have different settings, the lower value is used.</string>
			<string id="String_Policy_Configure_the_PCoIP_167" >Configure the PCoIP session MTU</string>
			<string id="String_Explain_Specifies_the_Maximum_168" >Specifies the Maximum Transmission Unit (MTU) size for UDP packets for a PCoIP session.

The MTU size includes IP and UDP packet headers. TCP uses the standard MTU discovery mechanism to set MTU and is not affected by this setting. The maximum MTU size is 1500 bytes. The minimum MTU size is 500 bytes. The default value is 1200 bytes.

Typically, you do not have to change the MTU size. Change this value if you have an unusual network setup that causes PCoIP packet fragmentation.

This setting applies to the agent and client. If the two endpoints have different MTU size settings, the lowest size is used.

If this setting is disabled or not configured, the client uses the default value in the negotiation with the agent.</string>
			<string id="String_Policy_Configure_the_PCoIP_171" >Configure the PCoIP session bandwidth floor</string>
			<string id="String_Explain_Specifies_a_lower_172" >Specifies a lower limit, in kilobits per second, for the bandwidth that is reserved by the PCoIP session.

This setting configures the minimum expected bandwidth transmission rate for the endpoint. When you use this setting to reserve bandwidth for an endpoint, the session does not have to wait for bandwidth to become available, which improves session responsiveness.

Make sure that you do not over-subscribe the total reserved bandwidth for all endpoints. Make sure that the sum of bandwidth floors for all connections in your configuration does not exceed the network capability.

The default value is 0, which means that no minimum bandwidth is reserved. When this setting is disabled or not configured, no minimum bandwidth is reserved.

This setting applies to the agent and client, but the setting only affects the endpoint on which it is configured.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Enable_disable_175" >Enable/disable audio in the PCoIP session</string>
			<string id="String_Explain_Determines_whether_176" >Determines whether audio is enabled in PCoIP sessions. Both endpoints must have audio enabled. When this setting is enabled, PCoIP audio is allowed. When it is disabled, PCoIP audio is disabled. When this setting is not configured, audio is enabled by default.

</string>
			<string id="String_Policy_Enable_disable_178" >Enable/disable microphone noise and DC offset filter in PCoIP session</string>
			<string id="String_Explain_Determines_whether_179" >Determines whether to enable the microphone noise and DC offset filter for microphone input during PCoIP sessions.

This setting applies to the agent and Teradici audio driver only.

When this setting is not configured, the Teradici audio driver uses the microphone noise and DC offset filter by default.</string>
			<string id="String_Policy_Configure_the_PCoIP_181" >Configure the PCoIP session audio bandwidth limit</string>
			<string id="String_Explain_Specifies_the_maximum_182" >Specifies the maximum bandwidth that can be used for audio (sound playback) in a PCoIP session.

The audio processing monitors the bandwidth used for audio. The processing selects the audio compression algorithm that provides the best audio possible, given the current bandwidth utilization. If a bandwidth limit is set, the processing reduces quality by changing the compression algorithm selection until the bandwidth limit is reached. If minimum quality audio cannot be provided within the bandwidth limit specified, audio is disabled.

To allow for uncompressed high quality stereo audio, set this value to higher than 1600 kbit/s. A value of 450 kbit/s and higher allows for stereo, high-quality, compressed audio. A value between 50 kbit/s and 450 kbit/s results in audio that ranges between FM radio and phone call quality. A value below 50 kbit/s might result in no audio playback.

This setting applies to the agent only. You must enable audio on both endpoints before this setting has any effect.

In addition, this setting has no effect on USB audio.

If this setting is disabled or not configured, a default audio bandwidth limit of 500 kilobits per second is configured to constrain the audio compression algorithm selected. If the setting is configured, the value is measured in kilobits per second, with a default audio bandwidth limit of 500 kilobits per second.

This setting applies to View 4.6 and later. It has no effect on earlier versions of View.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Configure_SSL_connections_185" >Configure SSL connections to satisfy Security Tools</string>
			<string id="String_Explain_Specifies_how_SSL_186" >Specifies how SSL session negotiation connections are established.

In order to satisfy port scanners, enable this 'Configure SSL connections' setting and on a View Agent, do the following:

1. In Microsoft Management Console, store a correctly named and signed certificate into the Personal store for the Local Machine's computer account. Make sure to mark it exportable.
2. Store the certificate for the Certificate Authority that signed it in the Trusted Root certificate store.
3. Disable connections to VMware View 5.1 and earlier.
4. Configure the agent to load certificates only from the Certificate Store. If the Personal store for the Local Machine is used, leave the certificate store names unchanged as “MY” and “ROOT” (without the quotes), unless a different store location was used in steps 1 and 2.

The resulting PCoIP Server will satisfy Security Tools such as port scanners.

Checking the box to enforce AES-256 or stronger ciphers will prevent the use of AES-128 ciphers suites during SSL negotiation.

If this 'Configure SSL connections' setting is disabled or not configured:

1. This endpoint will connect to VMware View 5.1 and earlier endpoints as well as newer ones.
2. The endpoint will use certificates from the machine account's “MY” store and Certification Authority certificates from the “ROOT” store.
3. An agent will try to load a certificate but generate a unique self-signed certificate if none is found.
4. The minimum key size will be 1024
5. The Server's certificate will be its own, not that of the View Connection Server.
6. The AES-128 cipher suite will be available.</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_From_the_Certificate_189" >From the Certificate Store</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_Generate_a_unique_190" >Generate a unique self-signed certificate</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_From_the_Certificate_191" >From the Certificate Store if possible, otherwise generate</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_1024_194" >1024</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_2048_195" >2048</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_4096_196" >4096</string>
			<string id="String_Policy_Configure_PCoIP_201" >Configure PCoIP session encryption algorithms</string>
			<string id="String_Explain_Controls_the_encryption_202" >Controls the encryption algorithms advertised by the PCoIP endpoint during session negotiation.

Checking one of the check boxes disables the associated encryption algorithm. You must enable at least one algorithm.

This setting applies to both agent and client. The endpoints negotiate the actual session encryption algorithm that is used. If FIPS140-2 approved mode is enabled, the Disable AES-128-GCM encryption value is always overridden so that AES-128-GCM encryption is enabled.

If the overall &quot;Configure SSL Connections&quot; is disabled or not configured, both the Salsa20-256round12 and AES-128-GCM algorithms are available for negotiation by this endpoint.

Supported encryption algorithms, in order of preference, are SALSA20/12-256, AES-GCM-128, and AES-GCM-256. By default, all supported encryption algorithms are available for negotiation by this endpoint.

If both endpoints are configured to support all 3 algorithms and the connection does not use a Security Gateway (SG), the SALSA20 algorithm will be negotiated and used.  However if the connection uses a SG then SALSA20 is automatically disabled and AES128 will be negotiated and used. If either endpoint or the SG disables SALSA20 and either endpoint disables AES128, then AES256 will be negotiated and used.</string>
			<string id="String_Policy_Configure_SSL_protocols_207" >Configure SSL protocols</string>
			<string id="String_Explain_Configures_openssl_208" >Configures openssl protocol to restrict the use of certain protocols before establishing an encrypted SSL connection. The protocol list consists of one or more openssl protocol strings separated by colons. Note that all cipher strings are case insensitive.

 The default value is:
   &quot;TLS1.1:TLS1.2&quot;

 That means: TLS v1.1 and TLS v1.2 are enabled(SSL v2.0, SSLv3.0 and TLS v1.0 are disabled).

This setting applies to both agent and client.

If it is set on both side, the OpenSSL protocol negotiation rule will be followed.</string>
			<string id="String_Policy_Configure_SSL_cipher_list_209" >Configure SSL cipher list</string>
			<string id="String_Explain_Configures_SSL_cipher_list_210" >Configures SSL cipher list to restrict the use of cipher suite before establishing an encrypted SSL connection. The list consists of one or more cipher suite strings separated by colons. Note that all cipher strings are case insensitive.

The default value is:
   &quot;ECDHE-RSA-AES256-GCM-SHA384:AES256-SHA256:AES256-SHA:ECDHE-RSA-AES128-GCM-SHA256:AES128-SHA256:AES128-SHA:@STRENGTH&quot;

If this item is configured, the checkbox &quot;Enforce AES-256 or stronger ciphers for SSL connection negotiation&quot; in &quot;Configure SSL connections to satisfy Security Tools&quot; will be ignored.

This setting need to be applied to PCoIP server and PCoIP client at the same time.</string>
			<string id="String_Policy_Configure_PCoIP_211" >Configure PCoIP USB allowed and unallowed device rules</string>
			<string id="String_Explain_Specifies_the_USB_212" >Specifies the USB devices that are authorized and not authorized for PCoIP sessions that use a zero client that runs Teradici firmware. USB devices that are used in PCoIP sessions must appear in the USB authorization table. USB devices that appear in the USB unauthorization table cannot be used in PCoIP sessions.

You can define a maximum of 10 USB authorization rules and a maximum of 10 USB unauthorization rules. Separate multiple rules with the vertical bar (|) character.

Each rule can be a combination of a Vendor ID (VID) and a Product ID (PID), or a rule can describe a class of USB devices. A class rule can allow or disallow an entire device class, a single subclass, or a protocol within a subclass.

The format of a combination VID/PID rule is 1xxxxyyyy, where xxxx is the VID in hexadecimal format and yyyy is the PID in hexadecimal format. For example, the rule to authorize or block a device with VID 0x1a2b and PID 0x3c4d is 11a2b3c4d.

For class rules, use one of the following formats:

Allow all USB             Format: 23XXXXXX
devices                       Example: 23XXXXXX

Allow USB                  Format: 22classXXXX
devices with a            Example: 22aaXXXX
specific class ID

Allow a specific        Format: 21class-subclassXX
subclass                     Example: 21aabbXX

Allow a specific        Format: 20class-subclass-protocol
protocol                    Example: 20aabbcc

For example, the USB authorization string to allow USB HID (mouse and keyboard) devices (class ID 0x03) and webcams (class ID 0x0e) is 2203XXXX|220eXXXX. The USB unauthorization string to disallow USB Mass Storage devices (class ID 0x08) is 2208XXXX.

An empty USB authorization string means that no USB devices are authorized. An empty USB unauthorization string means that no USB devices are banned.

This setting applies to the server only and only when the server is in a session with a zero client that runs Teradici firmware. Device use is negotiated between the endpoints.

By default, all devices are allowed and none are disallowed.</string>
			<string id="String_Policy_Configure_the_TCP_216" >Configure the TCP port to which the PCoIP Server binds and listens</string>
			<string id="String_Explain_Specifies_the_TCP_217" >Specifies the TCP agent port bound to by software PCoIP hosts.

The TCP port value specifies the base TCP port that the agent attempts to bind to. The TCP port range value determines how many additional ports to try if the base port is not available. The port range must be between 0 and 10.

The range spans from the base port to the sum of the base port and port range. For example, if the base port is 4172 and the port range is 10, the range spans from 4172 to 4182.

This setting applies to the agent only.

By default, the base TCP port is 4172 for View 4.5 and later and 50002 for View 4.0.x and earlier. By default, the port range is 1.</string>
			<string id="String_Policy_Configure_the_UDP_221" >Configure the UDP port to which the PCoIP Server binds and listens</string>
			<string id="String_Explain_Specifies_the_UDP_222" >Specifies the UDP agent port bound to by software PCoIP hosts.

The UDP port value specifies the base UDP port that the agent attempts to bind to. The UDP port range value determines how many additional ports to try if the base port is not available. The port range must be between 0 and 10.

The range spans from the base port to the sum of the base port and port range. For example, if the base port is 4172 and the port range is 10, the range spans from 4172 to 4182.

This setting applies to the agent only.

By default, the base TCP port is 4172 for View 4.5 and later and 50002 for View 4.0.x and earlier. By default, the port range is 10.</string>
			<string id="String_Policy_Configure_PCoIP_226" >Configure PCoIP virtual channels</string>
			<string id="String_Explain_Specifies_the_virtual_227" >Specifies the virtual channels that can and cannot operate over PCoIP sessions. This setting also determines whether to disable clipboard processing on the PCoIP host.

Virtual channels that are used in PCoIP sessions must appear on the virtual channel authorization list. Virtual channels that appear in the unauthorized virtual channel list cannot be used in PCoIP sessions.

You can specify a maximum of 15 virtual channels for use in PCoIP sessions.

Separate multiple channel names with the vertical bar (|) character. Forexample, the virtual channel authorization string to allow the mksvchan and vdp_rdpvcbridge virtual channels is mksvchan|vdp_rdpvcbridge.

If a channel name contains the vertical bar or backslash (\) character, insert a backslash character before it. For example, type the channel name awk|ward\channel as awk\|ward\\channel.

When the authorized virtual channel list is empty, all virtual channels are disallowed. When the unauthorized virtual channel list is empty, all virtual channels are allowed.

The virtual channels setting applies to both agent and client. Virtual channels must be enabled on both agent and client for virtual channels to be used.

The virtual channels setting provides a separate check box that allows you to disable remote clipboard processing on the PCoIP host. This value applies to the agent only.

By default, all virtual channels are enabled, including clipboard processing.</string>
			<string id="String_Policy_DropList_Select_Configure_PCoIP_0_Disable_virtual_229" >0 - Disable virtual channels in PCoIP sessions</string>
			<string id="String_Policy_DropList_Select_Configure_PCoIP_2_Disable_all_230" >2 - Disable all virtual channels other than</string>
			<string id="String_Policy_DropList_Select_Configure_PCoIP_3_Enable_all_231" >3 - Enable all virtual channels other than</string>
			<string id="String_Policy_Configure_PCoIP_295" >Configure PCoIP image quality levels</string>
			<string id="String_Explain_Controls_how_PCoIP_296" >Controls how PCoIP renders images during periods of network congestion. The Minimum Image Quality, Maximum Initial Image Quality, and Maximum Frame Rate values interoperate to provide fine control in network-bandwidth constrained environments.

Use the Minimum Image Quality value to balance image quality and frame rate for limited-bandwidth scenarios. You can specify a value between 30 and 100. The default value is 40. A lower value allows higher frame-rates, but with a potentially lower quality display. A higher value provides higher image quality, but with potentially lower frame rates when network bandwidth is constrained. When network bandwidth is not constrained, PCoIP maintains maximum quality regardless of this value.

Use the Maximum Initial Image Quality value to reduce the network bandwidth peaks required by PCoIP by limiting the initial quality of the changed regions of the display image. You can specify a value between 30 and 100. The default value is 80. A lower value reduces the image quality of content changes and decreases peak bandwidth requirements. A higher value increases the image quality of content changes and increases peak bandwidth requirements. Unchanged regions of the image progressively build to a lossless (perfect) quality regardless of this value. A value of 80 or lower best utilizes the available bandwidth.

The Minimum Image Quality value cannot exceed the Maximum Initial Image Quality value.

Use the Maximum Frame Rate value to manage the average bandwidth consumed per user by limiting the number of screen updates per second. You can specify a value between 1 and 120 frames per second. The default value is 30. A higher value can use more bandwidth but provides less jitter, which allows smoother transitions in changing images such as video. A lower value uses less bandwidth but results in more jitter.

Set the 'Use image settings from client' when you want to use the 'Minimum Image Quality', 'Maximum Initial Image Quality', 'Maximum Frame Rate', 'Disable Build to Lossless' values from the client instead of the host. Currently, only Zero Client Firmware 3.5 and above support these settings on the client side.

These image quality values apply to the soft host only and have no effect on a soft client.

When this setting is disabled or not configured, the default values are used. When these settings are changed during runtime, they would take effect immediately.</string>
			<string id="String_Policy_Configure_frame_302" >Configure frame rate vs image quality preference</string>
			<string id="String_Explain_Configure_the_frame_303" >Configure the frame rate and image quality preference from 0 (highest frame rate) to 100 (highest image quality). If this policy is disabled or not configured, the default setting is 50.

Higher value (max: 100) means you prefer to high image quality while choppy frame rate is tolerant; Lower value (min: 0) means you prefer to fluent experience with aggressive image quality.

This setting could work with the 'Configure PCoIP image quality levels' GPO, which determines the max initial image quality level and min image quality level. While the 'Frame rate and image quality preference' could adjust the image quality level for each frame, it could not out of the max/min quality level threshold configured by 'Configure PCoIP image quality levels' GPO.

When this policy is changed during run time, it could take effect immediately.</string>
			<string id="String_Policy_Enable_access_to_306" >Enable access to a PCoIP session from a vSphere console</string>
			<string id="String_Explain_Determines_whether_307" >Determines whether to allow a vSphere Client console to display an active PCoIP session and send input to the desktop.

By default, when a client is attached through PCoIP, the vSphere Client console screen is blank and the console cannot send input. The default setting ensures that a malicious user cannot view the user's desktop or provide input to the host locally when a PCoIP remote session is active.

This setting applies to the agent only.

When this setting is disabled or not configured, console access is not allowed. When this setting is enabled, the console displays the PCoIP session and console input is allowed.

When this setting is enabled, the console can display a PCoIP session that is running on a Windows 7 system only when the Windows 7 virtual machine is hardware v8 or later. Hardware v8 is available only on ESX 5.0 and later. By contrast, console input to a Windows 7 system is allowed when the virtual machine is any hardware version.

On a Windows XP or Windows Vista system, the console can display a PCoIP session when the virtual machine is any hardware version.</string>
			<string id="String_Policy_Turn_on_PCoIP_user_309" >Turn on PCoIP user default input language synchronization</string>
			<string id="String_Explain_Determines_whether_310" >Determines whether the default input language for the user in the PCoIP session is synchronized with the default input language of the PCoIP client endpoint. When this setting is enabled, synchronization is allowed. When this setting is disabled or not configured, synchronization is disallowed.

This setting applies to the agent only.</string>
			<string id="String_Policy_Use_alternate_key_312" >Use alternate key for sending Secure Attention Sequence</string>
			<string id="String_Explain_Specifies_an_alternate_313" >Specifies an alternate key, instead of the Insert key, for sending a Secure Attention Sequence (SAS).

You can use this setting to preserve the Ctrl+Alt+Ins key sequence in virtual machines that are launched from inside a View desktop during a PCoIP session.

For example, a user can launch a vSphere Client from inside a PCoIP desktop and open a console on a virtual machine in vCenter Server. If the Ctrl+Alt+Ins sequence is used inside the guest operating system on the vCenter Server virtual machine, a Ctrl+Alt+Del SAS is sent to the virtual machine. This setting allows the Ctrl+Alt+Alternate Key sequence to send a Ctrl+Alt+Del SAS to the PCoIP desktop.

When this setting is enabled, you must select an alternate key from a dropdown menu. You cannot enable the setting and leave the value unspecified.

When this setting is disabled or not configured, the Ctrl+Alt+Ins key sequence is used as the SAS.

This setting applies to the agent only and has no effect on a client.</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Home_315" >Home</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_End_316" >End</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Page_Up_317" >Page Up</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Page_Down_318" >Page Down</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Backspace_319" >Backspace</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Tab_320" >Tab</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Print_Screen_321" >Print Screen</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Scroll_Lock_322" >Scroll Lock</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Right_Arrow_323" >Right Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Left_Arrow_324" >Left Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Down_Arrow_325" >Down Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Up_Arrow_326" >Up Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_327" >Keypad /</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_328" >Keypad *</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_329" >Keypad -</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_330" >Keypad +</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_Enter_331" >Keypad Enter</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_1_End_332" >Keypad 1 End</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_2_Down_333" >Keypad 2 Down</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_3_PageDn_334" >Keypad 3 PageDn</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_4_Left_335" >Keypad 4 Left</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_5_336" >Keypad 5</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_6_Right_337" >Keypad 6 Right</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_7_Home_338" >Keypad 7 Home</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_8_Up_339" >Keypad 8 Up</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_9_PageUp_340" >Keypad 9 PageUp</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_0_Insert_341" >Keypad 0 Insert</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_Delete_342" >Keypad . Delete</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_343" >- _</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_344" >= +</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_345" >[ {</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_346" >] }</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_347" >\ |</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_348" >; :</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_349" >' &quot;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_350" >` ~</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_351" >, &lt;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_352" >. &gt;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_353" >/ ?</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_a_A_354" >a A</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_b_B_355" >b B</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_c_C_356" >c C</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_d_D_357" >d D</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_e_E_358" >e E</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_f_F_359" >f F</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_g_G_360" >g G</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_h_H_361" >h H</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_i_I_362" >i I</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_j_J_363" >j J</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_k_K_364" >k K</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_l_L_365" >l L</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_m_M_366" >m M</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_n_N_367" >n N</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_o_O_368" >o O</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_p_P_369" >p P</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_q_Q_370" >q Q</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_r_R_371" >r R</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_s_S_372" >s S</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_t_T_373" >t T</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_u_U_374" >u U</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_v_V_375" >v V</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_w_W_376" >w W</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_x_X_377" >x X</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_y_Y_378" >y Y</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_z_Z_379" >z Z</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_1_380" >1 !</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_2_381" >2 @</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_3_382" >3 #</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_4_383" >4 $</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_5_384" >5 %</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_6_385" >6 ^</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_7_386" >7 &amp;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_8_387" >8 *</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_9_388" >9 (</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_0_389" >0 )</string>
			<string id="String_Policy_Disable_sending_391" >Disable sending CAD when users press Ctrl+Alt+Del</string>
			<string id="String_Explain_When_this_policy_392" >When this policy is enabled, users must press Ctrl+Alt+Insert instead of Ctrl+Alt+Del to send a Secure Attention Sequence (SAS) to the desktop during a PCoIP session.

You might want to enable this setting if users become confused when they press Ctrl+Alt+Del to lock the client endpoint and an SAS is sent to both the host and the guest.

This setting applies to the agent only and has no effect on a client.

When this policy is not configured or is disabled, users can press Ctrl+Alt+Del or Ctrl+Alt+Insert to send an SAS to the desktop.</string>
			<string id="String_Policy_Configure_the_PCoIP_394" >Configure the PCoIP transport header</string>
			<string id="String_Explain_Configures_the_395" >Configures the PCoIP transport header.

PCoIP transport header is a 32-bit long header which is added to all PCoIP UDP packets (only if the transport header is enabled/supported by both sides). PCoIP transport header allows network devices to make better prioritization/Qos decisions when dealing with network congestions. The transport header is enabled by default.

The transport session priority determines the PCoIP session priority reported in the PCoIP Transport Header. Network devices make better prioritization/Qos decisions based on the specified transport session priority.  The transport session priority value is negotiated by the PCoIP agent and client.  If agent has specified a transport session priority value (high, medium, or low), then the session uses the agent specified session priority.  If only the client has specified a transport session priority (high, medium, or low), then the session uses the client specified session priority.  If neither agent nor client has specified a transport session priority (or specified 'undefined priority'), then the session uses/defaults to the medium session priority.</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_High_Priority_397" >High Priority</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_Medium_Priority_398" >Medium Priority (default)</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_Low_Priority_399" >Low Priority</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_Undefined_Priority_400" >Undefined Priority</string>
			<string id="String_Policy_Configure_PCoIP_402" >Configure PCoIP event log verbosity</string>
			<string id="String_Explain_This_policy_enables_403" >This policy enables the configuration of the PCoIP event log verbosity ranging from 0 (least verbose) to 3 (most verbose).

When this policy is Disabled or Not Configured, the default event log verbosity setting is 2.  When this policy is Configured, the setting controls the verbosity level as described above.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Configure_PCoIP_406" >Configure PCoIP event log cleanup by time in days</string>
			<string id="String_Explain_This_policy_enables_407" >This policy enables the configuration of the PCoIP event log cleanup by time in days.

When this policy is Configured, the setting controls the log file cleanup by time in days, i.e for a non-zero setting of n, log files older than n days will be automatically (and silently) deleted; a setting of 0 indicates no file cleanup by time. When this policy is Disabled or Not Configured, the default event log cleanup by time in days setting is 7.

The log file cleanup is performed once at session startup; any change to the setting will not be applied until the next session.</string>
			<string id="String_Policy_Configure_PCoIP_410" >Configure PCoIP event log cleanup by size in MB</string>
			<string id="String_Explain_This_policy_enables_411" >This policy enables the configuration of the PCoIP event log cleanup by size in MB.

When this policy is Configured, the setting controls the log file cleanup by size in MB, i.e for a non-zero setting of m, log files larger than m MB will be automatically (and silently) deleted; a setting of 0 indicates no file cleanup by size. When this policy is Disabled or Not Configured, the default event log cleanup by size in MB setting is 100.

The log file cleanup is performed once at session startup; any change to the setting will not be applied until the next session.</string>
			<string id="String_Policy_Turn_off_Build_to_Lossles_414" >Turn off Build-to-Lossless feature</string>
			<string id="String_Explain_Specifies_whether_415" >Specifies whether to turn the build-to-lossless feature of the PCoIP protocol off or on; this feature is turned off by default.

If this setting is Enabled or Not Configured then the build-to-lossless feature is turned off and images and other desktop content may never build to a lossless state. In network environments with constrained bandwidth, turning off the build-to-lossless feature can provide bandwidth savings. If this setting is Disabled then the build-to-lossless feature is turned on; this is recommended for environments that require images and desktop content to be built to a lossless state.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Configure_the_maximum_417" >Configure the maximum PCoIP session bandwidth</string>
			<string id="String_Explain_Specifies_the_maximum_418" >Specifies the maximum bandwidth, in kilobits per second, in a PCoIP session. The bandwidth includes all imaging, audio, virtual channel, USB, and control PCoIP traffic.

Set this value based on the overall capacity of the link to which your endpoint is connected, taking into consideration the number of expected concurrent PCoIP sessions. For example, with a single user VDI configuration (e.g. a single PCoIP session) that connects through a 4Mbit/s Internet connection, set this value to 4Mbit (or 10% less than this value to leave some allowance for other network traffic). When you expect multiple concurrent PCoIP sessions to share a link (e.g. multiple VDI users or a RDSH configuration), you may want to adjust the setting accordingly, however this will restrict the maximum bandwidth for each active session.

Setting this value prevents the agent from attempting to transmit at a higher rate than the link capacity, which would cause excessive packet loss and a poorer user experience. This value is symmetric. It forces the client and agent to use the lower of the two values that are set on the client and agent side. For example, setting a 4Mbit/s maximum bandwidth forces the agent to transmit at a lower rate, even though the setting is configured on the client.

When this setting is disabled or not configured on an endpoint, the endpoint imposes no bandwidth constraints. When this setting is configured, the setting is used as the endpoint's maximum bandwidth constraint in kilobits per second.

The default value when this setting is not configured is 900000 kilobits per second.

This setting applies to the agent and client. If the two endpoints have different settings, the lower value is used.</string>
			<string id="String_Policy_Configure_the_PCoIP_421" >Configure the PCoIP session MTU</string>
			<string id="String_Explain_Specifies_the_Maximum_422" >Specifies the Maximum Transmission Unit (MTU) size for UDP packets for a PCoIP session.

The MTU size includes IP and UDP packet headers. TCP uses the standard MTU discovery mechanism to set MTU and is not affected by this setting. The maximum MTU size is 1500 bytes. The minimum MTU size is 500 bytes. The default value is 1200 bytes.

Typically, you do not have to change the MTU size. Change this value if you have an unusual network setup that causes PCoIP packet fragmentation.

This setting applies to the agent and client. If the two endpoints have different MTU size settings, the lowest size is used.

If this setting is disabled or not configured, the client uses the default value in the negotiation with the agent.</string>
			<string id="String_Policy_Configure_the_PCoIP_425" >Configure the PCoIP session bandwidth floor</string>
			<string id="String_Explain_Specifies_a_lower_426" >Specifies a lower limit, in kilobits per second, for the bandwidth that is reserved by the PCoIP session.

This setting configures the minimum expected bandwidth transmission rate for the endpoint. When you use this setting to reserve bandwidth for an endpoint, the session does not have to wait for bandwidth to become available, which improves session responsiveness.

Make sure that you do not over-subscribe the total reserved bandwidth for all endpoints. Make sure that the sum of bandwidth floors for all connections in your configuration does not exceed the network capability.

The default value is 0, which means that no minimum bandwidth is reserved. When this setting is disabled or not configured, no minimum bandwidth is reserved.

This setting applies to the agent and client, but the setting only affects the endpoint on which it is configured.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Enable_disable_429" >Enable/disable audio in the PCoIP session</string>
			<string id="String_Explain_Determines_whether_430" >Determines whether audio is enabled in PCoIP sessions. Both endpoints must have audio enabled. When this setting is enabled, PCoIP audio is allowed. When it is disabled, PCoIP audio is disabled. When this setting is not configured, audio is enabled by default.

</string>
			<string id="String_Policy_Enable_disable_432" >Enable/disable microphone noise and DC offset filter in PCoIP session</string>
			<string id="String_Explain_Determines_whether_433" >Determines whether to enable the microphone noise and DC offset filter for microphone input during PCoIP sessions.

This setting applies to the agent and Teradici audio driver only.

When this setting is not configured, the Teradici audio driver uses the microphone noise and DC offset filter by default.</string>
			<string id="String_Policy_Configure_the_PCoIP_435" >Configure the PCoIP session audio bandwidth limit</string>
			<string id="String_Explain_Specifies_the_maximum_436" >Specifies the maximum bandwidth that can be used for audio (sound playback) in a PCoIP session.

The audio processing monitors the bandwidth used for audio. The processing selects the audio compression algorithm that provides the best audio possible, given the current bandwidth utilization. If a bandwidth limit is set, the processing reduces quality by changing the compression algorithm selection until the bandwidth limit is reached. If minimum quality audio cannot be provided within the bandwidth limit specified, audio is disabled.

To allow for uncompressed high quality stereo audio, set this value to higher than 1600 kbit/s. A value of 450 kbit/s and higher allows for stereo, high-quality, compressed audio. A value between 50 kbit/s and 450 kbit/s results in audio that ranges between FM radio and phone call quality. A value below 50 kbit/s might result in no audio playback.

This setting applies to the agent only. You must enable audio on both endpoints before this setting has any effect.

In addition, this setting has no effect on USB audio.

If this setting is disabled or not configured, a default audio bandwidth limit of 500 kilobits per second is configured to constrain the audio compression algorithm selected. If the setting is configured, the value is measured in kilobits per second, with a default audio bandwidth limit of 500 kilobits per second.

This setting applies to View 4.6 and later. It has no effect on earlier versions of View.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Configure_SSL_connections_439" >Configure SSL connections to satisfy Security Tools</string>
			<string id="String_Explain_Specifies_how_SSL_440" >Specifies how SSL session negotiation connections are established.

In order to satisfy port scanners, enable this 'Configure SSL connections' setting and on a View Agent, do the following:

1. In Microsoft Management Console, store a correctly named and signed certificate into the Personal store for the Local Machine's computer account. Make sure to mark it exportable.
2. Store the certificate for the Certificate Authority that signed it in the Trusted Root certificate store.
3. Disable connections to VMware View 5.1 and earlier.
4. Configure the agent to load certificates only from the Certificate Store. If the Personal store for the Local Machine is used, leave the certificate store names unchanged as “MY” and “ROOT” (without the quotes), unless a different store location was used in steps 1 and 2.

The resulting PCoIP Server will satisfy Security Tools such as port scanners.

Checking the box to enforce AES-256 or stronger ciphers will prevent the use of AES-128 ciphers suites during SSL negotiation.

If this 'Configure SSL connections' setting is disabled or not configured:

1. This endpoint will connect to VMware View 5.1 and earlier endpoints as well as newer ones.
2. The endpoint will use certificates from the machine account's “MY” store and Certification Authority certificates from the “ROOT” store.
3. An agent will try to load a certificate but generate a unique self-signed certificate if none is found.
4. The minimum key size will be 1024
5. The Server's certificate will be its own, not that of the View Connection Server.
6. The AES-128 cipher suite will be available.</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_a_From_the_Certificate_443" >(a) From the Certificate Store</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_b_Generate_a_444" >(b) Generate a unique self-signed certificate</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_c_From_the_Certificate_445" >(c) From the Certificate Store if possible, otherwise generate</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_1024_448" >1024</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_2048_449" >2048</string>
			<string id="String_Policy_DropList_Select_Configure_SSL_connections_4096_450" >4096</string>
			<string id="String_Policy_Configure_PCoIP_455" >Configure PCoIP session encryption algorithms</string>
			<string id="String_Explain_Controls_the_encryption_456" >Controls the encryption algorithms advertised by the PCoIP endpoint during session negotiation.

Checking one of the check boxes disables the associated encryption algorithm. You must enable at least one algorithm.

This setting applies to both agent and client. The endpoints negotiate the actual session encryption algorithm that is used. If FIPS140-2 approved mode is enabled, the Disable AES-128-GCM encryption value is always overridden so that AES-128-GCM encryption is enabled.

If the overall &quot;Configure SSL Connections&quot; is disabled or not configured, both the Salsa20-256round12 and AES-128-GCM algorithms are available for negotiation by this endpoint.

Supported encryption algorithms, in order of preference, are SALSA20/12-256, AES-GCM-128, and AES-GCM-256. By default, all supported encryption algorithms are available for negotiation by this endpoint.

If both endpoints are configured to support all 3 algorithms and the connection does not use a Security Gateway (SG), the SALSA20 algorithm will be negotiated and used.  However if the connection uses a SG then SALSA20 is automatically disabled and AES128 will be negotiated and used. If either endpoint or the SG disables SALSA20 and either endpoint disables AES128, then AES256 will be negotiated and used.</string>
			<string id="String_Policy_Configure_SSL_protocols_461" >Configure SSL protocols</string>
			<string id="String_Explain_Configures_openssl_462" >Configures openssl protocol to restrict the use of certain protocols before establishing an encrypted SSL connection. The protocol list consists of one or more openssl protocol strings separated by colons. Note that all cipher strings are case insensitive.

 The default value is:
   &quot;TLS1.1:TLS1.2&quot;

 That means: TLS v1.1 and TLS v1.2 are enabled(SSL v2.0, SSLv3.0 and TLS v1.0 are disabled).

This setting applies to both agent and client.

If it is set on both side, the OpenSSL protocol negotiation rule will be followed.</string>
			<string id="String_Policy_Configure_SSL_cipher_list_463" >Configure SSL cipher list</string>
			<string id="String_Explain_Configures_SSL_cipher_list_464" >Configures SSL cipher list to restrict the use of cipher suite before establishing an encrypted SSL connection. The list consists of one or more cipher suite strings separated by colons. Note that all cipher strings are case insensitive.

The default value is:
   &quot;ECDHE-RSA-AES256-GCM-SHA384:AES256-SHA256:AES256-SHA:ECDHE-RSA-AES128-GCM-SHA256:AES128-SHA256:AES128-SHA:@STRENGTH&quot;

If this item is configured, the checkbox &quot;Enforce AES-256 or stronger ciphers for SSL connection negotiation&quot; in &quot;Configure SSL connections to satisfy Security Tools&quot; will be ignored.

This setting need to be applied to PCoIP server and PCoIP client at the same time.</string>
			<string id="String_Policy_Configure_PCoIP_465" >Configure PCoIP USB allowed and unallowed device rules</string>
			<string id="String_Explain_Specifies_the_USB_466" >Specifies the USB devices that are authorized and not authorized for PCoIP sessions that use a zero client that runs Teradici firmware. USB devices that are used in PCoIP sessions must appear in the USB authorization table. USB devices that appear in the USB unauthorization table cannot be used in PCoIP sessions.

You can define a maximum of 10 USB authorization rules and a maximum of 10 USB unauthorization rules. Separate multiple rules with the vertical bar (|) character.

Each rule can be a combination of a Vendor ID (VID) and a Product ID (PID), or a rule can describe a class of USB devices. A class rule can allow or disallow an entire device class, a single subclass, or a protocol within a subclass.

The format of a combination VID/PID rule is 1xxxxyyyy, where xxxx is the VID in hexadecimal format and yyyy is the PID in hexadecimal format. For example, the rule to authorize or block a device with VID 0x1a2b and PID 0x3c4d is 11a2b3c4d.

For class rules, use one of the following formats:

Allow all USB             Format: 23XXXXXX
devices                       Example: 23XXXXXX

Allow USB                  Format: 22classXXXX
devices with a            Example: 22aaXXXX
specific class ID

Allow a specific        Format: 21class-subclassXX
subclass                     Example: 21aabbXX

Allow a specific        Format: 20class-subclass-protocol
protocol                    Example: 20aabbcc

For example, the USB authorization string to allow USB HID (mouse and keyboard) devices (class ID 0x03) and webcams (class ID 0x0e) is 2203XXXX|220eXXXX. The USB unauthorization string to disallow USB Mass Storage devices (class ID 0x08) is 2208XXXX.

An empty USB authorization string means that no USB devices are authorized. An empty USB unauthorization string means that no USB devices are banned.

This setting applies to the server only and only when the server is in a session with a zero client that runs Teradici firmware. Device use is negotiated between the endpoints.

By default, all devices are allowed and none are disallowed.</string>
			<string id="String_Policy_Configure_the_TCP_470" >Configure the TCP port to which the PCoIP Server binds and listens</string>
			<string id="String_Explain_Specifies_the_TCP_471" >Specifies the TCP agent port bound to by software PCoIP hosts.

The TCP port value specifies the base TCP port that the agent attempts to bind to. The TCP port range value determines how many additional ports to try if the base port is not available. The port range must be between 0 and 10.

The range spans from the base port to the sum of the base port and port range. For example, if the base port is 4172 and the port range is 10, the range spans from 4172 to 4182.

This setting applies to the agent only.

By default, the base TCP port is 4172 for View 4.5 and later and 50002 for View 4.0.x and earlier. By default, the port range is 1.</string>
			<string id="String_Policy_Configure_the_UDP_475" >Configure the UDP port to which the PCoIP Server binds and listens</string>
			<string id="String_Explain_Specifies_the_UDP_476" >Specifies the UDP agent port bound to by software PCoIP hosts.

The UDP port value specifies the base UDP port that the agent attempts to bind to. The UDP port range value determines how many additional ports to try if the base port is not available. The port range must be between 0 and 10.

The range spans from the base port to the sum of the base port and port range. For example, if the base port is 4172 and the port range is 10, the range spans from 4172 to 4182.

This setting applies to the agent only.

By default, the base TCP port is 4172 for View 4.5 and later and 50002 for View 4.0.x and earlier. By default, the port range is 10.</string>
			<string id="String_Policy_Configure_PCoIP_480" >Configure PCoIP virtual channels</string>
			<string id="String_Explain_Specifies_the_virtual_481" >Specifies the virtual channels that can and cannot operate over PCoIP sessions. This setting also determines whether to disable clipboard processing on the PCoIP host.

Virtual channels that are used in PCoIP sessions must appear on the virtual channel authorization list. Virtual channels that appear in the unauthorized virtual channel list cannot be used in PCoIP sessions.

You can specify a maximum of 15 virtual channels for use in PCoIP sessions.

Separate multiple channel names with the vertical bar (|) character. Forexample, the virtual channel authorization string to allow the mksvchan and vdp_rdpvcbridge virtual channels is mksvchan|vdp_rdpvcbridge.

If a channel name contains the vertical bar or backslash (\) character, insert a backslash character before it. For example, type the channel name awk|ward\channel as awk\|ward\\channel.

When the authorized virtual channel list is empty, all virtual channels are disallowed. When the unauthorized virtual channel list is empty, all virtual channels are allowed.

The virtual channels setting applies to both agent and client. Virtual channels must be enabled on both agent and client for virtual channels to be used.

The virtual channels setting provides a separate check box that allows you to disable remote clipboard processing on the PCoIP host. This value applies to the agent only.

By default, all virtual channels are enabled, including clipboard processing.</string>
			<string id="String_Policy_DropList_Select_Configure_PCoIP_0_Disable_virtual_483" >0 - Disable virtual channels in PCoIP sessions</string>
			<string id="String_Policy_DropList_Select_Configure_PCoIP_2_Disable_all_484" >2 - Disable all virtual channels other than</string>
			<string id="String_Policy_DropList_Select_Configure_PCoIP_3_Enable_all_485" >3 - Enable all virtual channels other than</string>
			<string id="String_Policy_Configure_PCoIP_549" >Configure PCoIP image quality levels</string>
			<string id="String_Explain_Controls_how_PCoIP_550" >Controls how PCoIP renders images during periods of network congestion. The Minimum Image Quality, Maximum Initial Image Quality, and Maximum Frame Rate values interoperate to provide fine control in network-bandwidth constrained environments.

Use the Minimum Image Quality value to balance image quality and frame rate for limited-bandwidth scenarios. You can specify a value between 30 and 100. The default value is 40. A lower value allows higher frame-rates, but with a potentially lower quality display. A higher value provides higher image quality, but with potentially lower frame rates when network bandwidth is constrained. When network bandwidth is not constrained, PCoIP maintains maximum quality regardless of this value.

Use the Maximum Initial Image Quality value to reduce the network bandwidth peaks required by PCoIP by limiting the initial quality of the changed regions of the display image. You can specify a value between 30 and 100. The default value is 80. A lower value reduces the image quality of content changes and decreases peak bandwidth requirements. A higher value increases the image quality of content changes and increases peak bandwidth requirements. Unchanged regions of the image progressively build to a lossless (perfect) quality regardless of this value. A value of 80 or lower best utilizes the available bandwidth.

The Minimum Image Quality value cannot exceed the Maximum Initial Image Quality value.

Use the Maximum Frame Rate value to manage the average bandwidth consumed per user by limiting the number of screen updates per second. You can specify a value between 1 and 120 frames per second. The default value is 30. A higher value can use more bandwidth but provides less jitter, which allows smoother transitions in changing images such as video. A lower value uses less bandwidth but results in more jitter.

Set the 'Use image settings from client' when you want to use the 'Minimum Image Quality', 'Maximum Initial Image Quality', 'Maximum Frame Rate', 'Disable Build to Lossless' values from the client instead of the host. Currently, only Zero Client Firmware 3.5 and above support these settings on the client side.

These image quality values apply to the soft host only and have no effect on a soft client.

When this setting is disabled or not configured, the default values are used. When these settings are changed during runtime, they would take effect immediately.</string>
			<string id="String_Policy_Configure_frame_556" >Configure frame rate vs image quality preference</string>
			<string id="String_Explain_Configure_the_frame_557" >Configure the frame rate and image quality preference from 0 (highest frame rate) to 100 (highest image quality). If this policy is disabled or not configured, the default setting is 50.

Higher value (max: 100) means you prefer to high image quality while choppy frame rate is tolerant; Lower value (min: 0) means you prefer to fluent experience with aggressive image quality.

This setting could work with the 'Configure PCoIP image quality levels' GPO, which determines the max initial image quality level and min image quality level. While the 'Frame rate and image quality preference' could adjust the image quality level for each frame, it could not out of the max/min quality level threshold configured by 'Configure PCoIP image quality levels' GPO.

When this policy is changed during run time, it could take effect immediately.</string>
			<string id="String_Policy_Enable_access_to_560" >Enable access to a PCoIP session from a vSphere console</string>
			<string id="String_Explain_Determines_whether_561" >Determines whether to allow a vSphere Client console to display an active PCoIP session and send input to the desktop.

By default, when a client is attached through PCoIP, the vSphere Client console screen is blank and the console cannot send input. The default setting ensures that a malicious user cannot view the user's desktop or provide input to the host locally when a PCoIP remote session is active.

This setting applies to the agent only.

When this setting is disabled or not configured, console access is not allowed. When this setting is enabled, the console displays the PCoIP session and console input is allowed.

When this setting is enabled, the console can display a PCoIP session that is running on a Windows 7 system only when the Windows 7 virtual machine is hardware v8 or later. Hardware v8 is available only on ESX 5.0 and later. By contrast, console input to a Windows 7 system is allowed when the virtual machine is any hardware version.

On a Windows XP or Windows Vista system, the console can display a PCoIP session when the virtual machine is any hardware version.</string>
			<string id="String_Policy_Turn_on_PCoIP_user_563" >Turn on PCoIP user default input language synchronization</string>
			<string id="String_Explain_Determines_whether_564" >Determines whether the default input language for the user in the PCoIP session is synchronized with the default input language of the PCoIP client endpoint. When this setting is enabled, synchronization is allowed. When this setting is disabled or not configured, synchronization is disallowed.

This setting applies to the agent only.</string>
			<string id="String_Policy_Use_alternate_key_566" >Use alternate key for sending Secure Attention Sequence</string>
			<string id="String_Explain_Specifies_an_alternate_567" >Specifies an alternate key, instead of the Insert key, for sending a Secure Attention Sequence (SAS).

You can use this setting to preserve the Ctrl+Alt+Ins key sequence in virtual machines that are launched from inside a View desktop during a PCoIP session.

For example, a user can launch a vSphere Client from inside a PCoIP desktop and open a console on a virtual machine in vCenter Server. If the Ctrl+Alt+Ins sequence is used inside the guest operating system on the vCenter Server virtual machine, a Ctrl+Alt+Del SAS is sent to the virtual machine. This setting allows the Ctrl+Alt+Alternate Key sequence to send a Ctrl+Alt+Del SAS to the PCoIP desktop.

When this setting is enabled, you must select an alternate key from a dropdown menu. You cannot enable the setting and leave the value unspecified.

When this setting is disabled or not configured, the Ctrl+Alt+Ins key sequence is used as the SAS.

This setting applies to the agent only and has no effect on a client.</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Home_569" >Home</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_End_570" >End</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Page_Up_571" >Page Up</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Page_Down_572" >Page Down</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Backspace_573" >Backspace</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Tab_574" >Tab</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Print_Screen_575" >Print Screen</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Scroll_Lock_576" >Scroll Lock</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Right_Arrow_577" >Right Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Left_Arrow_578" >Left Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Down_Arrow_579" >Down Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Up_Arrow_580" >Up Arrow</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_581" >Keypad /</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_582" >Keypad *</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_583" >Keypad -</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_584" >Keypad +</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_Enter_585" >Keypad Enter</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_1_End_586" >Keypad 1 End</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_2_Down_587" >Keypad 2 Down</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_3_PageDn_588" >Keypad 3 PageDn</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_4_Left_589" >Keypad 4 Left</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_5_590" >Keypad 5</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_6_Right_591" >Keypad 6 Right</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_7_Home_592" >Keypad 7 Home</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_8_Up_593" >Keypad 8 Up</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_9_PageUp_594" >Keypad 9 PageUp</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_0_Insert_595" >Keypad 0 Insert</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_Keypad_Delete_596" >Keypad . Delete</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_597" >- _</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_598" >= +</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_599" >[ {</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_600" >] }</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_601" >\ |</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_602" >; :</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_603" >' &quot;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_604" >` ~</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_605" >, &lt;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_606" >. &gt;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_607" >/ ?</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_a_A_608" >a A</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_b_B_609" >b B</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_c_C_610" >c C</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_d_D_611" >d D</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_e_E_612" >e E</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_f_F_613" >f F</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_g_G_614" >g G</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_h_H_615" >h H</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_i_I_616" >i I</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_j_J_617" >j J</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_k_K_618" >k K</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_l_L_619" >l L</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_m_M_620" >m M</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_n_N_621" >n N</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_o_O_622" >o O</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_p_P_623" >p P</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_q_Q_624" >q Q</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_r_R_625" >r R</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_s_S_626" >s S</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_t_T_627" >t T</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_u_U_628" >u U</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_v_V_629" >v V</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_w_W_630" >w W</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_x_X_631" >x X</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_y_Y_632" >y Y</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_z_Z_633" >z Z</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_1_634" >1 !</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_2_635" >2 @</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_3_636" >3 #</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_4_637" >4 $</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_5_638" >5 %</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_6_639" >6 ^</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_7_640" >7 &amp;</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_8_641" >8 *</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_9_642" >9 (</string>
			<string id="String_Policy_DropList_Select_Use_alternate_key_0_643" >0 )</string>
			<string id="String_Policy_Disable_sending_645" >Disable sending CAD when users press Ctrl+Alt+Del</string>
			<string id="String_Explain_When_this_policy_646" >When this policy is enabled, users must press Ctrl+Alt+Insert instead of Ctrl+Alt+Del to send a Secure Attention Sequence (SAS) to the desktop during a PCoIP session.

You might want to enable this setting if users become confused when they press Ctrl+Alt+Del to lock the client endpoint and an SAS is sent to both the host and the guest.

This setting applies to the agent only and has no effect on a client.

When this policy is not configured or is disabled, users can press Ctrl+Alt+Del or Ctrl+Alt+Insert to send an SAS to the desktop.</string>
			<string id="String_Policy_Configure_the_PCoIP_648" >Configure the PCoIP transport header</string>
			<string id="String_Explain_Configures_the_649" >Configures the PCoIP transport header.

PCoIP transport header is a 32-bit long header which is added to all PCoIP UDP packets (only if the transport header is enabled/supported by both sides). PCoIP transport header allows network devices to make better prioritization/Qos decisions when dealing with network congestions. The transport header is enabled by default.

The transport session priority determines the PCoIP session priority reported in the PCoIP Transport Header. Network devices make better prioritization/Qos decisions based on the specified transport session priority.  The transport session priority value is negotiated by the PCoIP agent and client.  If agent has specified a transport session priority value (high, medium, or low), then the session uses the agent specified session priority.  If only the client has specified a transport session priority (high, medium, or low), then the session uses the client specified session priority.  If neither agent nor client has specified a transport session priority (or specified 'undefined priority'), then the session uses/defaults to the medium session priority.</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_High_Priority_651" >High Priority</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_Medium_Priority_652" >Medium Priority (default)</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_Low_Priority_653" >Low Priority</string>
			<string id="String_Policy_DropList_Select_Configure_the_PCoIP_Undefined_Priority_654" >Undefined Priority</string>
			<string id="String_Policy_Configure_PCoIP_656" >Configure PCoIP event log verbosity</string>
			<string id="String_Explain_This_policy_enables_657" >This policy enables the configuration of the PCoIP event log verbosity ranging from 0 (least verbose) to 3 (most verbose).

When this policy is Disabled or Not Configured, the default event log verbosity setting is 2.  When this policy is Configured, the setting controls the verbosity level as described above.

When this setting is modified during an active PCoIP session, it will take effect immediately.</string>
			<string id="String_Policy_Configure_PCoIP_660" >Configure PCoIP event log cleanup by time in days</string>
			<string id="String_Explain_This_policy_enables_661" >This policy enables the configuration of the PCoIP event log cleanup by time in days.

When this policy is Configured, the setting controls the log file cleanup by time in days, i.e for a non-zero setting of n, log files older than n days will be automatically (and silently) deleted; a setting of 0 indicates no file cleanup by time. When this policy is Disabled or Not Configured, the default event log cleanup by time in days setting is 7.

The log file cleanup is performed once at session startup; any change to the setting will not be applied until the next session.</string>
			<string id="String_Policy_Configure_PCoIP_664" >Configure PCoIP event log cleanup by size in MB</string>
			<string id="String_Explain_This_policy_enables_665" >This policy enables the configuration of the PCoIP event log cleanup by size in MB.

When this policy is Configured, the setting controls the log file cleanup by size in MB, i.e for a non-zero setting of m, log files larger than m MB will be automatically (and silently) deleted; a setting of 0 indicates no file cleanup by size. When this policy is Disabled or Not Configured, the default event log cleanup by size in MB setting is 100.

The log file cleanup is performed once at session startup; any change to the setting will not be applied until the next session.</string>
		</stringTable>
		<presentationTable ><!--Storage for Presentation Definitions-->

			<presentation id="Policy_Configure_the_maximum_162" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_maximum_165" spinStep="100" spin="true" defaultValue="900000" >Set PCoIP session bandwidth in kilobits per second to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_166" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_PCoIP_169" spinStep="1" spin="true" defaultValue="1200" >Set PCoIP MTU size in bytes to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_170" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_PCoIP_173" spinStep="1" spin="true" defaultValue="0" >Set PCoIP session bandwidth floor in kilobits per second to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_180" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_PCoIP_183" spinStep="1" spin="true" defaultValue="500" >Set audio BW limit in kilobits per second to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_SSL_connections_184" >
				<checkBox refId="Policy_CheckBox_Element_Configure_SSL_connections_187" >Disable connections from VMware View 5.1 and earlier</checkBox>
				<dropdownList refId="Policy_DropList_Element_Configure_SSL_connections_188" defaultItem="2" >How a Server chooses the certificate it presents to post-VMware View 5.1 components:</dropdownList>
				<textBox refId="Policy_TextBox_Element_Configure_SSL_connections_192" >
					<label >Name of the Machine account's Certificate Store to search for a certificate:</label>
					<defaultValue >MY</defaultValue>
				</textBox>
				<dropdownList refId="Policy_DropList_Element_Configure_SSL_connections_193" defaultItem="0" >The minimum keylength enforced when validating the certificate (1024, 2048 or 4096):</dropdownList>
				<textBox refId="Policy_TextBox_Element_Configure_SSL_connections_197" >
					<label >Name of the Machine account's Certificate Store to search for a Certificate Authority's certificate:</label>
					<defaultValue >ROOT</defaultValue>
				</textBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_SSL_connections_198" >Server instructs client to request the View Connection Server's certificate</checkBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_SSL_connections_199" >Enforce AES-256 or stronger ciphers for SSL connection negotiation</checkBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_200" >
				<text >At least one encryption algorithm must be enabled. (See Explain)</text>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_203" >Disable Salsa20-256-round12 encryption</checkBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_204" >Disable AES-128-GCM encryption</checkBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_205" >Disable AES-256-GCM encryption</checkBox>
			</presentation>
			<presentation id="Policy_Configure_SSL_protocols_206" >
				<textBox refId="Policy_TextBox_Element_Configure_SSL_protocols_209" >
					<label >Configure SSL protocols</label>
					<defaultValue >TLS1.1:TLS1.2</defaultValue>
				</textBox>
			</presentation>
			<presentation id="Policy_Configure_SSL_cipher_list_207" >
				<textBox refId="Policy_TextBox_Element_Configure_SSL_cipher_list_210" >
					<label >Configure SSL cipher list</label>
					<defaultValue >ECDHE-RSA-AES256-GCM-SHA384:AES256-SHA256:AES256-SHA:ECDHE-RSA-AES128-GCM-SHA256:AES128-SHA256:AES128-SHA:@STRENGTH</defaultValue>
				</textBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_210" >
				<text >See the Explain tab for authorization string formats and examples.</text>
				<comboBox refId="Policy_Combo_Element_Configure_PCoIP_213" noSort="true" >
					<label >Enter the USB authorization table (maximum ten rules):</label>
					<default >23XXXXXX</default>
					<suggestion >23XXXXXX</suggestion>
					<suggestion >2203XXXX</suggestion>
				</comboBox>
				<text >See the Explain tab for unauthorization string formats and examples.</text>
				<comboBox refId="Policy_Combo_Element_Configure_PCoIP_214" noSort="true" >
					<label >Enter the USB unauthorization table (maximum ten rules):</label>
					<suggestion >2203XXXX</suggestion>
				</comboBox>
			</presentation>
			<presentation id="Policy_Configure_the_TCP_215" >
				<text >Set a TCP agent port to bind to and the size of the retry range.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_TCP_218" spinStep="1" spin="true" defaultValue="4172" >Choose a TCP port to listen and bind to:</decimalTextBox>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_TCP_219" spinStep="1" spin="true" defaultValue="1" >Set the size of the retry port range:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_UDP_220" >
				<text >Set a UDP port and the size of the retry range.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_UDP_223" spinStep="1" spin="true" defaultValue="4172" >Choose a UDP port:</decimalTextBox>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_UDP_224" spinStep="1" spin="true" defaultValue="10" >Set the size of the retry port range:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_225" >
				<dropdownList refId="Policy_DropList_Element_Configure_PCoIP_228" defaultItem="0" >Virtual channel setting:</dropdownList>
				<text >The following setting is only required and applicable if 2 is selected.</text>
				<text >See the Explain tab for string formats and examples.</text>
				<textBox refId="Policy_TextBox_Element_Configure_PCoIP_232" >
					<label >Enter the authorized virtual channel list:</label>
				</textBox>
				<text >The following setting is only required and applicable if 3 is selected.</text>
				<text >See the Explain tab for string formats and examples.</text>
				<textBox refId="Policy_TextBox_Element_Configure_PCoIP_233" >
					<label >Enter the unauthorized virtual channel list:</label>
				</textBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_294" >
				<text >See the Explain tab for example values.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_297" spinStep="10" spin="true" defaultValue="40" >Set the Minimum Image Quality value (default value: 40):</decimalTextBox>
				<text >Set the Maximum Initial Image Quality value</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_298" spinStep="10" spin="true" defaultValue="80" >(default value: 80):</decimalTextBox>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_299" spinStep="1" spin="true" defaultValue="30" >Set the Maximum Frame Rate value (default value: 30):</decimalTextBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_300" >Use image settings from zero client if available</checkBox>
				<text >(default value: disabled; not applicable for soft client)</text>
			</presentation>
			<presentation id="Policy_Configure_frame_301" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_frame_304" spinStep="1" spin="true" defaultValue="50" >Set PCoIP frame rate vs quality factor to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Use_alternate_key_311" >
				<text >Use alternate instead of the Insert key to send a Secure Attention</text>
				<dropdownList refId="Policy_DropList_Element_Use_alternate_key_314" >Sequence (SAS)</dropdownList>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_393" >
				<dropdownList refId="Policy_DropList_Element_Configure_the_PCoIP_396" defaultItem="3" >Transport session priority</dropdownList>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_401" >
				<text >See the Explain tab for example values.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_404" spinStep="1" spin="true" defaultValue="2" >Set the event log verbosity value (2 for default):</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_405" >
				<text >See the Explain tab for example values.</text>
				<text >Set the event log cleanup by time value in days (7 default, 0 for no</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_408" spinStep="1" spin="true" defaultValue="7" >cleanup by time):</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_409" >
				<text >See the Explain tab for example values.</text>
				<text >Set the event log cleanup by size value in MB (100 default, 0 for no</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_412" spinStep="1" spin="true" defaultValue="100" >cleanup by size):</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_maximum_416" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_maximum_419" spinStep="100" spin="true" defaultValue="900000" >Set PCoIP session bandwidth in kilobits per second to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_420" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_PCoIP_423" spinStep="1" spin="true" defaultValue="1200" >Set PCoIP MTU size in bytes to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_424" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_PCoIP_427" spinStep="1" spin="true" defaultValue="0" >Set PCoIP session bandwidth floor in kilobits per second to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_434" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_PCoIP_437" spinStep="1" spin="true" defaultValue="500" >Set audio BW limit in kilobits per second to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_SSL_connections_438" >
				<checkBox refId="Policy_CheckBox_Element_Configure_SSL_connections_441" >Disable connections from VMware View 5.1 and earlier</checkBox>
				<dropdownList refId="Policy_DropList_Element_Configure_SSL_connections_442" defaultItem="2" >How a Server chooses the certificate it presents to post-VMware View 5.1 components:</dropdownList>
				<textBox refId="Policy_TextBox_Element_Configure_SSL_connections_446" >
					<label >Name of the Machine account's Certificate Store to search for a certificate:</label>
					<defaultValue >MY</defaultValue>
				</textBox>
				<dropdownList refId="Policy_DropList_Element_Configure_SSL_connections_447" defaultItem="0" >The minimum keylength enforced when validating the certificate (1024, 2048 or 4096):</dropdownList>
				<textBox refId="Policy_TextBox_Element_Configure_SSL_connections_451" >
					<label >Name of the Machine account's Certificate Store to search for a Certificate Authority's certificate:</label>
					<defaultValue >ROOT</defaultValue>
				</textBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_SSL_connections_452" >Server instructs client to request the View Connection Server's certificate</checkBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_SSL_connections_453" >Enforce AES-256 or stronger ciphers for SSL connection negotiation</checkBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_454" >
				<text >At least one encryption algorithm must be enabled. (See Explain)</text>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_457" >Disable Salsa20-256-round12 encryption</checkBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_458" >Disable AES-128-GCM encryption</checkBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_459" >Disable AES-256-GCM encryption</checkBox>
			</presentation>
			<presentation id="Policy_Configure_SSL_protocols_460" >
				<textBox refId="Policy_TextBox_Element_Configure_SSL_protocols_463" >
					<label >Configure SSL protocols</label>
					<defaultValue >TLS1.1:TLS1.2</defaultValue>
				</textBox>
			</presentation>
			<presentation id="Policy_Configure_SSL_cipher_list_461" >
				<textBox refId="Policy_TextBox_Element_Configure_SSL_cipher_list_462" >
					<label >Configure SSL cipher list</label>
					<defaultValue >ECDHE-RSA-AES256-GCM-SHA384:AES256-SHA256:AES256-SHA:ECDHE-RSA-AES128-GCM-SHA256:AES128-SHA256:AES128-SHA:@STRENGTH</defaultValue>
				</textBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_464" >
				<text >See the Explain tab for authorization string formats and examples.</text>
				<comboBox refId="Policy_Combo_Element_Configure_PCoIP_467" noSort="true" >
					<label >Enter the USB authorization table (maximum ten rules):</label>
					<default >23XXXXXX</default>
					<suggestion >23XXXXXX</suggestion>
					<suggestion >2203XXXX</suggestion>
				</comboBox>
				<text >See the Explain tab for unauthorization string formats and examples.</text>
				<comboBox refId="Policy_Combo_Element_Configure_PCoIP_468" noSort="true" >
					<label >Enter the USB unauthorization table (maximum ten rules):</label>
					<suggestion >2203XXXX</suggestion>
				</comboBox>
			</presentation>
			<presentation id="Policy_Configure_the_TCP_469" >
				<text >Set a TCP agent port to bind to and the size of the retry range.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_TCP_472" spinStep="1" spin="true" defaultValue="4172" >Choose a TCP port to listen and bind to:</decimalTextBox>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_TCP_473" spinStep="1" spin="true" defaultValue="1" >Set the size of the retry port range:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_the_UDP_474" >
				<text >Set a UDP port and the size of the retry range.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_UDP_477" spinStep="1" spin="true" defaultValue="4172" >Choose a UDP port:</decimalTextBox>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_the_UDP_478" spinStep="1" spin="true" defaultValue="10" >Set the size of the retry port range:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_479" >
				<dropdownList refId="Policy_DropList_Element_Configure_PCoIP_482" defaultItem="0" >Virtual channel setting:</dropdownList>
				<text >The following setting is only required and applicable if 2 is selected.</text>
				<text >See the Explain tab for string formats and examples.</text>
				<textBox refId="Policy_TextBox_Element_Configure_PCoIP_486" >
					<label >Enter the authorized virtual channel list:</label>
				</textBox>
				<text >The following setting is only required and applicable if 3 is selected.</text>
				<text >See the Explain tab for string formats and examples.</text>
				<textBox refId="Policy_TextBox_Element_Configure_PCoIP_487" >
					<label >Enter the unauthorized virtual channel list:</label>
				</textBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_548" >
				<text >See the Explain tab for example values.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_551" spinStep="10" spin="true" defaultValue="40" >Set the Minimum Image Quality value (default value: 40):</decimalTextBox>
				<text >Set the Maximum Initial Image Quality value</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_552" spinStep="10" spin="true" defaultValue="80" >(default value: 80):</decimalTextBox>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_553" spinStep="1" spin="true" defaultValue="30" >Set the Maximum Frame Rate value (default value: 30):</decimalTextBox>
				<checkBox refId="Policy_CheckBox_Element_Configure_PCoIP_554" >Use image settings from zero client if available</checkBox>
				<text >(default value: disabled; not applicable for soft client)</text>
			</presentation>
			<presentation id="Policy_Configure_frame_555" >
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_frame_558" spinStep="1" spin="true" defaultValue="50" >Set PCoIP frame rate vs quality factor to:</decimalTextBox>
			</presentation>
			<presentation id="Policy_Use_alternate_key_565" >
				<text >Use alternate instead of the Insert key to send a Secure Attention</text>
				<dropdownList refId="Policy_DropList_Element_Use_alternate_key_568" >Sequence (SAS)</dropdownList>
			</presentation>
			<presentation id="Policy_Configure_the_PCoIP_647" >
				<dropdownList refId="Policy_DropList_Element_Configure_the_PCoIP_650" defaultItem="3" >Transport session priority</dropdownList>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_655" >
				<text >See the Explain tab for example values.</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_658" spinStep="1" spin="true" defaultValue="2" >Set the event log verbosity value (2 for default):</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_659" >
				<text >See the Explain tab for example values.</text>
				<text >Set the event log cleanup by time value in days (7 default, 0 for no</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_662" spinStep="1" spin="true" defaultValue="7" >cleanup by time):</decimalTextBox>
			</presentation>
			<presentation id="Policy_Configure_PCoIP_663" >
				<text >See the Explain tab for example values.</text>
				<text >Set the event log cleanup by size value in MB (100 default, 0 for no</text>
				<decimalTextBox refId="Policy_Numeric_ElementConfigure_PCoIP_666" spinStep="1" spin="true" defaultValue="100" >cleanup by size):</decimalTextBox>
			</presentation>
		</presentationTable>
	</resources>
</policyDefinitionResources>
