{
  "rule_id": "adcs_cert_template_name_flag_modified",
  "name": "AD CS Certificate Template Modified to Allow Subject Name Supply",
  "description": "Detects modifications to the 'msPKI-Certificate-Name-Flag' attribute of a certificate template, where it is configured to allow the enrollee to supply the subject name. This change can be exploited for privilege escalation via Active Directory Certificate Services (AD CS).",
  "severity": "critical",
  "enabled": true,
  "language": "esql",
  "query": "from winlogbeat-* | where winlog.channel = 'Security' and winlog.event_id = '5136' and winlog.event_data.ObjectClass = 'pKICertificateTemplate' and winlog.event_data.AttributeLDAPDisplayName = 'msPKI-Certificate-Name-Flag' and winlog.event_data.Attributevalue = '1' | keep host.name, winlog.event_data.SubjectUserName, winlog.event_data.ObjectName, winlog.event_data.AttributeLDAPDisplayName, winlog.event_data.Attributevalue",
  "type": "esql",
  "threat": [
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0004",
        "name": "Privilege Escalation",
        "reference": "https://attack.mitre.org/tactics/TA0004/"
      },
      "technique": [
        {
          "id": "T1649",
          "name": "Credentials in Registry",
          "reference": "https://attack.mitre.org/techniques/T1649/"
        }
      ]
    },
    {
      "framework": "MITRE ATT&CK",
      "tactic": {
        "id": "TA0006",
        "name": "Credential Access",
        "reference": "https://attack.mitre.org/tactics/TA0006/"
      },
      "technique": [
        {
          "id": "T1003",
          "name": "OS Credential Dumping",
          "reference": "https://attack.mitre.org/techniques/T1003/"
        }
      ]
    }
  ],
  "interval": "1h",
  "from": "now-1h",
  "max_signals": 100,
  "risk_score": 95,
  "output_index": ".alerts-security.alerts-default",
  "meta": {},
  "version": 1,
  "references": [
    "https://www.specterops.io/assets/resources/Certified_Pre-Owned.pdf",
    "https://www.blackhillsinfosec.com/abusing-active-directory-certificate-services-part-one/"
  ],
  "tags": [
    "Active Directory",
    "AD CS",
    "Privilege Escalation",
    "ESC1"
  ],
  "actions": [],
  "throttle": "no_throttle",
  "custom_query_fields": [],
  "event_group": "winlog.event_data.SubjectUserName, winlog.event_data.ObjectName"
}
