{
  "type": "detection-engine.rule",
  "id": "potential-dcsync-attack",
  "attributes": {
    "risk_score": 85,
    "enabled": true,
    "name": "Potential DCSync Activity Detection",
    "description": "Detects suspicious directory replication service (DRS) activity via event 4662 or network activity to domain controllers. This can indicate a DCSync attack, a method used to harvest credentials.",
    "rule_id": "potential_dcsync_activity",
    "index": ["win_logs*", "winlogbeat-*"],
    "language": "kuery",
    "query": "(winlog.channel:\"Security%\" AND event.code:\"4662\" AND (winlog.event_data.ObjectType:\"*19195a5b-6da0-11d0-afd3-00c04fd930c9%\" OR winlog.event_data.ObjectType:\"*1131f6aa-9c07-11d1-f79f-00c04fc2dcd2%\" OR winlog.event_data.ObjectType:\"*1131f6ad-9c07-11d1-f79f-00c04fc2dcd2%\" OR winlog.event_data.ObjectType:\"*89e95b76-444d-4c62-991a-0facbeda640c%\" OR winlog.event_data.ObjectType:\"*replicationSynchronization%\" OR winlog.event_data.ObjectType:\"*replicating Directory Changes All%\\\") AND winlog.event_data.AccessMask:\"0x100\") OR (winlog.channel:\"Microsoft-Windows-Sysmon/Operational\" AND event.code:\"3\" AND (destination.port:135 OR destination.port:389 OR destination.port:88))",
    "interval": "10m",
    "severity": "high",
    "type": "query",
    "version": "1"
  }
}
