{
  "type": "detection-engine.rule",
  "id": "taurus-intrusion",
  "attributes": {
    "risk_score": 90,
    "enabled": true,
    "name": "Taurus Intrusion Detection",
    "description": "Detects indicators of compromise (IOCs) and tactics, techniques, and procedures (TTPs) associated with the Taurus intrusion set, including file hashes, network connections, C2 URLs, user-agent anomalies, and persistence mechanisms.",
    "rule_id": "taurus_intrusion_detection",
    "index": ["logs-endpoint.events.*", "logs-network.*"],
    "language": "kuery",
    "query": "(file.hash.sha256:\"202f6b6631ade2c41e4762b5877ce0063a3beabce0c3f8564b6499a1164c1e04\" OR destination.ip:(\"173.44.141.89\" OR \"80.77.23.48\" OR \"62.60.226.73\" OR \"107.158.128.45\" OR \"170.130.165.112\" OR \"107.158.128.105\") OR (url.full:\"*mhousecreative.com*\" OR url.full:\"*google.herionhelpline.com*\" OR url.full:\"*/service/*\" OR url.full:\"*/c91252f9ab114f26.php\") OR (http.request.user_agent:\"*Googlebot*\" AND destination.ip:(\"173.44.141.89\" OR \"80.77.23.48\" OR \"62.60.226.73\" OR \"107.158.128.45\")) OR (process.name:\"schtasks.exe\" AND process.command_line:\"*/create*\" AND process.command_line:\"*/sc*\" AND process.command_line:\"*onlogon*\"))",
    "interval": "15m",
    "severity": "critical",
    "type": "query",
    "version": "1"
  }
}
