title: CRYSTALRAY Credential and History File Exfiltration
id: f74f8afe-26f3-4655-ba02-d8ec99656ff4
status: experimental
description: Detects attempts to find and exfiltrate sensitive files, such as shell history or environment configuration files, using a combination of `find` and `curl`. This technique is used by the CRYSTALRAY threat actor to steal credentials and other sensitive information.
references:
  - https://www.sysdig.com/blog/crystalray-rising-threat-actor-exploiting-oss-tools
author: RW
date: 2025-08-07
tags:
  - attack.collection
  - attack.t1005
  - attack.credential_access
  - attack.t1552.003
  - attack.exfiltration
  - attack.t1048.003
  - threat_actor.crystalray
logsource:
  category: process_creation
  product: linux
detection:
  history_exfil:
    CommandLine|contains|all:
      - 'find'       # Searches for files
      - '.bash_history'       # Specifically targets shell history files
      - 'curl'       # Uses curl for exfiltration
      - '--upload-file'       # The specific curl flag for uploading files
  env_exfil:
    CommandLine|contains|all:
      - 'find'       # Searches for files
      - 'curl'
      - '--upload-file'
    CommandLine|contains:     # Targets one of many common environment file names
      - '.env'
      - '.env.bak'
      - 'config.env'
      - '.env.local'
      - '.environment'
      - '.envrc'
  condition: 1 of them
falsepositives:
  - Legitimate administrative or backup scripts might perform similar actions, but the use of `curl --upload-file` in combination with finding these specific file types is anomalous and characteristic of the threat actor's scripts.
level: high
