title: AWS IAM User Creation or Login Profile Modification
id: a390c70e-adfd-474c-9289-ed19ab193b6d
status: experimental
description: Detects the creation of new IAM users or the creation/modification of their login profiles. This activity can indicate an attacker establishing persistence in an AWS account by creating new accounts or enabling console access for existing ones.
references:
  - https://www.chrisfarris.com/post/aws-ir/
author: RW
date: 2025-08-19
tags:
  - attack.persistence
  - attack.t1136
  - attack.t1098
logsource:
  product: aws
  service: cloudtrail
detection:
  selection:
        # Detects creation of a new user or creation/modification of a login profile (e.g., adding a password)
    eventName:
      - CreateUser
      - UpdateLoginProfile
      - CreateLoginProfile
  condition: selection
falsepositives:
  - Legitimate user provisioning by administrators or automated systems (e.g., Terraform, CI/CD pipelines).
  - It is highly recommended to filter events generated by known administrative users, roles, or from trusted IP address ranges to reduce noise.
level: high
