<policyDefinitionResources revision="1.0" schemaVersion="1.0">
  <displayName>
  </displayName>
  <description>
  </description>
  <resources>
    <stringTable>
      <string id="Product_CatName">Serial COM</string>
      <string id="LocalSettingsPriority_PolicyName">Local settings priority</string>
      <string id="LocalSettingsPriority_PolicyExplain">If this policy setting is enabled, the local program settings have priority over policy settings.

If this policy setting is disabled or not configured, policy settings have priority over local program settings.

Within the scope of each type of settings, the settings set for the computer always have priority over settings set for the user.
If this policy setting is set for the computer, it has priority over policy setting set for the user.</string>
      <string id="DisableFunctionality_PolicyName">Disable functionality</string>
      <string id="DisableFunctionality_PolicyExplain">If this policy setting is enabled, the connection with the client side is not established, the ports are not redirected and the tray menu icon is not present.

If this policy setting is disabled, the Serial COM works in usual mode.

If this policy setting is not configured, the disabling functionality is determined by local program settings.</string>
      <string id="RedirectAll_PolicyName">Connect all ports automatically</string>
      <string id="RedirectAll_PolicyExplain">If this policy setting is enabled, all client COM ports will be automatically connected (even if no individual GPO is configured). If there are individual GPO settings configured for some of the ports, the individual port GPO settings are used.

If this policy setting is disabled or not configured, the auto-connect functionality is determined by individual port GPO or local program settings.</string>
      <string id="EnableEventLog_PolicyName">Enable Windows Event Log functionality</string>
      <string id="EnableEventLog_PolicyExplain">If this policy setting is enabled, different serial port related events will be written to the Application Log category of the Windows Event Log.

If this policy setting is disabled or not configured, no any log records will write to Application part of Windows EventViewer.

The following events are supported:
5 - Trying to establish a connection to the Client PC.
10 - Connection between agent and client sides is established.
20 - Connection is closed between agent and client sides.
30 - The initial port enumeration (the list of serial ports available on the Client PC and available for the connection).
40 - Connected. The port has been connected.
41 - Connected. The port is occupied (while session reconnected). The port becomes readable/writable again.
50 - Disconnected. The port has disconnected.
51 - Disconnected. The port is occupied (while session disconnect detected). The port remains active but not readable/writable.
60 - Error

The format of the port item entry:
&lt;Source port name&gt; DELIMETER &lt;Destination port name&gt; DELIMETER &lt;Hardware ID&gt; DELIMITER &lt;Device Description&gt;

&lt;Source port name&gt; – the name of the COM port, as it appears on the Client PC, e.g. COM2
&lt;Destination port name&gt; – the name of virtual COM port, as it appears in remote desktop session, e.g. COM15
&lt;Hardware ID&gt; and &lt;Description&gt; - The parent device properties (in case of the serial port on the Client PC is actually a USB or some other device)
DELIMETER - Event data format separator string

Example (comma-character is used as a DELIMITER):
COM20,COM28,USB\VID_067B&amp;PID_2303&amp;REV_0400,Prolific USB-to-Serial Comm Port</string>
      <string id="EventLogTableSeparator_PolicyName">Enable Event data format separator</string>
      <string id="EventLogTableSeparator_PolicyExplain">When enabled, this policy defines the string that is used row separator for data fields.

The default separator is Tab-character. But it’s possible to change it to any other character, like a comma, a semicolon, a space, or any other custom character or even a string.</string>
	  <string id="EventLogTableSeparatorType_TAB_combo_txt">Tab</string>
	  <string id="EventLogTableSeparatorType_SPACE_combo_txt">Space</string>
	  <string id="EventLogTableSeparatorType_custom_combo_txt">Custom string</string>
      <string id="PortIsolationMode_PolicyName">COM Port Isolation Mode</string>
      <string id="PortIsolationMode_PolicyExplain">If "Full Isolation" mode is chosen, virtual serial ports are visible and accessible within user sessions only. In this mode COM port names can have the same names in different user sessions. Important: system services (like spoolsrv.exe) are not able to access isolated serial ports in such case".

If "Isolation Disabled" mode is chosen, virtual serial ports are visible globally. Any port can be accessed from any session. Limitation: port names must be unique for every user (so the ports cannot have the same names in different user sessions). Important: system services (like spoolsrv.exe) can access any serial ports".

If this policy setting is not configured, Serial Redirection operates in "Full Isolation" mode.</string>
      <string id="PortIsolationMode_Full_Isolation_combo_txt">Full Isolation</string>
      <string id="PortIsolationMode_Isolation_Disabled_combo_txt">Isolation Disabled</string>
      <string id="LockConfig_PolicyName">Lock configuration</string>
      <string id="LockConfig_PolicyExplain">If this policy setting is enabled, the user interface containing the program settings is locked and the user can't change settings in the tray menu.

If this policy setting is disabled, the user interface containing the program settings is accessible for users.

If this policy setting is not configured, the blocking of the configuration is determined by local program settings.

If this policy setting is configured for the computer, it has priority over policy setting configured for the user.</string>
      <string id="BandwidthLimit_PolicyName">Bandwidth limit</string>
      <string id="BandwidthLimit_PolicyExplain">If this policy setting is enabled, the data transfer speed between the agent and all clients is limited by the specified kilobytes per second.The value "0" disables speed limitation

If this policy setting is disabled, the speed limitation is disabled.

If this policy setting is not configured, the speed limitation is determined by local program settings.</string>
      <string id="BandwidthLimit_PartName">Bandwidth limit (in kilobytes per second):</string>

	  <string id="AllowDenyPortFiltersList_PolicyName">Allow/Deny port filters</string>
	  <string id="AllowDenyPortFiltersList_PolicyExplain">If this policy is enabled, the Allow and Deny filers are used in order to decide if every specific COM port detected on the Client side is allowed for redirection or not.

In case if some port is not allowed for redirection, the Agent side will threat it as if the port does not even exist on the Client side.

The policy is multi-line string that contains a list of rules.

Example:
  USB:067B:2303:*
  USBPATH:1-4
  WINDEVID:*ACPI*
  PORTNAME:COM3
  PORTNAME:COM5

Syntax:
  USB:[*|VID[:*|:PID[:*|:REV]]]
    VID - Hex numeric VID (Vendor ID) value from device HardwareID
    PID - Hex numeric PID (Product ID) value from device HardwareID
    REV - Hex numeric REV (Revision) value from device HardwareID
    when VID, PID, REV equal to "*" - it means any value.

  USBPATH:[N1[-N2[...[-N8]]]]
    Nx - Numeric value (1-127 range) that identifies the USB port.

  WINDEVID:[HwId|*|?]
    HwId - full or partial value of device HardwareID (wildcards characters * and ? are supported). Case insensitive.

  PORTNAME:[PortName|*|?]
    PortName - full or partial value of serial port name (wildcards characters * and ? are supported). Case insensitive.

Examples:
  USB:067B:2303:400 - matches the USB device with the specified VID, PID and Revision. USB\VID_067B&amp;PID_2303&amp;REV_0400
  USB:067B:2303:* - matches any USB device with the specified VID and PID and any Revision. USB\VID_067B&amp;PID_2303
  USB:067B:* - matches any USB device with the specified VID and any PID and any Revision. USB\VID_067B
  USB:* - matches any USB device

  USBPATH:1-2-1 - matches the identificator of the USB port where the device is plugged physically

  WINDEVID:*  - matches any HardwareID string
  WINDEVID:*ACPI* - matches a HardwareID string containing ACPI substring

  PORTNAME:COM3 - matches only "COM3" serial port
  PORTNAME:*M3 - matches serial ports with the names ending with "M3". E.g. COM3, VCOM3.
  PORTNAME:*M3* - matches serial ports with names containing "M3" substring. E.g. COM3, COM33, VCOM333.
  PORTNAME:/dev/ttys* - matches all "/dev/ttys" devices. E.g. /dev/ttyS0, /dev/ttyS5.

Remarks:
  The Allow list has higher priority. So if the device is matched by the Deny list, the device is excluded from the redirection. But if at the same time the device is matched by the Allow list, the device is allowed for the redirection.
	  </string>
	  <string id="AllowDenyPortFiltersList_PartName">Allow List</string>
	  <string id="DenyDenyPortFiltersList_PartName">Deny List</string>

      <string id="PortSettings_CatName">PortSettings</string>
      <string id="PortSettings1_PolicyName">PortSettings1</string>
      <string id="PortSettings2_PolicyName">PortSettings2</string>
      <string id="PortSettings3_PolicyName">PortSettings3</string>
      <string id="PortSettings4_PolicyName">PortSettings4</string>
      <string id="PortSettings5_PolicyName">PortSettings5</string>
      <string id="PortSettings_PolicyExplain">This policy setting is used for configuring certain port parameters that are used for their redirection:

"Source port number" - Number of the COM port redirected from the client side (e.g. 2 means COM2).

"Source port device" - By default, the name of Serial port device redirected from the client side. Also, special syntax is supported for complex serial device matching.

Note: This parameter has higher priority than Source port number.

Source port is usually identified by the device name (e.g., "COM5" for Windows, or "/dev/ttySerial0" for Linux). Anyway, special matching syntax is supported in order to identify the source serial device by USB device properties, USB Port identifier and so on. Refer to Allow/deny filters section for more details.

"Destination virtual port number" - virtual COM port number, created on the agent side and corresponding to the COM port on the client side.

"Autoconnect" - If this flag is set, the port is automatically redirected to the agent side when it plugged on the client side.

"IgnoreDsr" - If this flag is set, the DSR signal is ignored.

"Pause before close port" - Troubleshooting setting. Time (in ms) to wait after virtual COM port was closed by user. Required for some USB-COM adapters.

"Use pause before send data" - If this flag is set, pause before send data after port opening will use. See value "Pause before send data"

"Pause before send data" - Troubleshooting setting. Time (in ms) to wait before virtual COM port will transfer data to physycal side. Required for some specific serial devices (Olivetti card reader).

"Serial2USBModeChangeEnabled" - Troubleshooting setting. Fixes specific issues of GlobalSat BU353 GPS adapter (and some other Prolific USB-COM adapters).

"Disable errors in wait mask" - Troubleshooting setting. Disables "error" value in serial COM mask. See "http://msdn.microsoft.com/en-us/library/windows/desktop/aa363479(v=vs.85).aspx". Required for some software.

"HandleBtDisappear" - Troubleshooting setting. Supports BlueTooth COM-ports specific behavior.

"UsbToComTroubleShooting" - Troubleshooting setting. Fixes some specific issues of USB-COM adapters.

"Use network latency compensation" - Troubleshooting setting. Use compensation capability to avoid influence of network delays.

"Compensation level" - Troubleshooting setting. Using spinedit, select network latency compensation level. Find out the minimal level at which your communications application works stable with a remote serial device.

"Use fixed baud rate" - If this flag is set, the value specified in "Bits per second" is used instead of the baudrate set by serial communications application.

"Bits per second" - Fixed baudrate value in bits per second (applied, if "Use fixed baud rate" is set).

"Use fixed line control" -  - If this flag is set, the values specified in "Data bits", "Parity" and "Stop bits" are used instead of the values set by serial communications application.

"Data bits" - Fixed Databits value (applied, if "Use fixed line control" is set) [values from 5 to 8].

"Parity" - Fixed Parity value (applied, if "Use fixed line control" is set).

"Stop bits" - Fixed Stop bits value (applied, if "Use fixed line control" is set).

"Use fixed flow control" -  - If this flag is set, the value specified in "Flow control" is used instead of the value set by serial communications application.

"Flow control" - Fixed Stop bits value (applied, if "Use fixed flow control" is set).


If this policy setting is enabled, its parameters are used during port redirection.

If this policy setting is disabled or not configured, parameters specified in local program settings are used for port redirection.

If this policy setting is configured for the computer, it has priority over policy setting configured for the user.</string>
      <string id="SrcPort_PartName">Source port number:</string>
      <string id="SrcPort_PartName2">Source port device:</string>
      <string id="DstVirtPort_PartName">Destination virtual port number:</string>
      <string id="Autoconnect_PartName">Autoconnect</string>
      <string id="Troubleshooting_PartName">Troubleshooting:</string>
      <string id="IgnoreDsr_PartName">IgnoreDsr</string>
      <string id="PauseBeforeClosePort_PartName">Pause before close port (in milliseconds):</string>
      <string id="UsePauseBeforeSendData_PartName">Use pause before send data:</string>
      <string id="PauseBeforeSendData_PartName">Pause before send data (in milliseconds):</string>
      <string id="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</string>
      <string id="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</string>
      <string id="HandleBtDisappear_PartName">HandleBtDisappear</string>
      <string id="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</string>
      <string id="UseFixedBaudRate_PartName">Use fixed baud rate</string>
      <string id="FixedBaudRate_PartName">Fixed baudrate value in bits per second (applied, if "Use fixed baud rate" is set).</string>
      <string id="UseFixedLineControl_PartName">Use fixed line control</string>
      <string id="FixedDataBits_PartName">Fixed Databits value (applied, if "Use fixed line control" is set) [values from 5 to 8].</string>
      <string id="Parity_No_combo_txt">No</string>
      <string id="Parity_Odd_combo_txt">Odd</string>
      <string id="Parity_Even_combo_txt">Even</string>
      <string id="Parity_Mark_combo_txt">Mark</string>
      <string id="Parity_Space_combo_txt">Space</string>
      <string id="StopBits_1bit_combo_txt">1 bit</string>
      <string id="StopBits_15bit_combo_txt">1.5 bits</string>
      <string id="StopBits_2bits_combo_txt">2 bits</string>
      <string id="UseFixedFlowControl_PartName">Use fixed flow control</string>
      <string id="Flow_Hardware_combo_txt">Hardware</string>
      <string id="Flow_XonXoff_combo_txt">Xon/Xoff</string>
      <string id="Flow_None_combo_txt">None</string>
      <string id="ADMXMigrator_UnresolvedString">ADMX Migrator encountered a string that is not present in the source ADM string table.</string>
      <string id="ADMXMigrator_NoSupportedOn">ADMX Migrator encountered a policy that does not have a supportedOn value.</string>
      <string id="SUPPORTED_WindowsXP">At least Microsoft Windows XP Professional or Windows Server 2003 family</string>
      <string id="UseMultiplicator_PartName">Use network latency compensation</string>
      <string id="MultiplicatorValue_PartName">Compensation level value (applied, if "Use network latency compensation" is set) [values from 1 to 10].</string>
    </stringTable>
    <presentationTable>
      <presentation id="LocalSettingsPriority_PolicyName" />
      <presentation id="DisableFunctionality_PolicyName" />
      <presentation id="EnableEventLog_PolicyName" />
	  <presentation id="EventLogTableSeparator_PolicyName">
		<dropdownList refId="EventLogTableSeparatorType_Enum" noSort="true">Event data format separator:</dropdownList>
        <textBox refId="EventLogTableSeparatorType_custom_Text">
            <label>Custom string:</label>
        </textBox>
	  </presentation>
      <presentation id="RedirectAll_PolicyName" />
      <presentation id="PortIsolationMode_PolicyName">
        <dropdownList refId="PortIsolationMode_Enum" noSort="true">COM Port Isolation Mode:</dropdownList>
      </presentation>
      <presentation id="LockConfig_PolicyName" />
      <presentation id="BandwidthLimit_PolicyName">
        <decimalTextBox refId="BandwidthLimit_PartName" defaultValue="0" spinStep="1024">Bandwidth limit (in kilobytes per second):</decimalTextBox>
      </presentation>
      <presentation id="AllowDenyPortFiltersList_PolicyName">
		  <text>Allow List</text>
		  <multiTextBox refId="AllowPortFiltersList_PartName" />
		  <text></text>
		  <text>Deny List</text>
		  <multiTextBox refId="DenyPortFiltersList_PartName" />
      </presentation>
      <presentation id="PortSettings1_PolicyName">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings2_PolicyName">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings3_PolicyName">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings4_PolicyName">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings5_PolicyName">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="LocalSettingsPriority_PolicyName_1" />
      <presentation id="LockConfig_PolicyName_1" />
      <presentation id="PortSettings1_PolicyName_1">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings2_PolicyName_1">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings3_PolicyName_1">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings4_PolicyName_1">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
      <presentation id="PortSettings5_PolicyName_1">
        <decimalTextBox refId="SrcPort_PartName">Source port number:</decimalTextBox>
        <textBox refId="SrcPort_PartName2">
            <label>Source port device:</label>
        </textBox>
        <decimalTextBox refId="DstVirtPort_PartName">Destination virtual port number:</decimalTextBox>
        <checkBox refId="Autoconnect_PartName">Autoconnect</checkBox>
        <text>
        </text>
        <text>Troubleshooting:</text>
        <checkBox refId="IgnoreDsr_PartName">IgnoreDsr</checkBox>
        <decimalTextBox refId="PauseBeforeClosePort_PartName" defaultValue="0" spinStep="100">Pause before close port (in milliseconds):</decimalTextBox>
        <checkBox refId="UsePauseBeforeSendData_PartName">Use pause before send data:</checkBox>
        <decimalTextBox refId="PauseBeforeSendData_PartName" defaultValue="500" spinStep="50">Pause before send data (in milliseconds):</decimalTextBox>
        <checkBox refId="Serial2USBModeChangeEnabled_PartName">Serial2USBModeChangeEnabled</checkBox>
        <checkBox refId="DisableErrorsInWaitMask_PartName">Disable errors in wait mask</checkBox>
        <checkBox refId="HandleBtDisappear_PartName">HandleBtDisappear</checkBox>
        <checkBox refId="UsbToComTroubleShooting_PartName">UsbToComTroubleShooting</checkBox>
        <checkBox refId="UseMultiplicator_PartName">Use network latency compensation</checkBox>
        <decimalTextBox refId="MultiplicatorValue_PartName" defaultValue="1" spinStep="1">Compensation level:</decimalTextBox>
        <text>
        </text>
        <text>Fixed Settings:</text>
        <checkBox refId="UseFixedBaudRate_PartName">Use fixed baud rate</checkBox>
        <decimalTextBox refId="FixedBaudRate_PartName" defaultValue="9600" spinStep="100">Bits per second:</decimalTextBox>
        <checkBox refId="UseFixedLineControl_PartName">Use fixed line control</checkBox>
        <decimalTextBox refId="FixedDataBits_PartName" defaultValue="8" spinStep="1">Data bits:</decimalTextBox>
        <dropdownList refId="FixedParity_Enum" defaultItem="0" noSort="true">Parity:</dropdownList>
        <dropdownList refId="FixedStopBits_Enum" defaultItem="0" noSort="true">Stop bits:</dropdownList>
        <checkBox refId="UseFixedFlowControl_PartName">Use fixed flow control</checkBox>
        <dropdownList refId="FixedFlowControl_Enum" defaultItem="0" noSort="true">Flow control:</dropdownList>
      </presentation>
    </presentationTable>
  </resources>
</policyDefinitionResources>